Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_io_bank0.h
/*
SPDX-License-Identifier: MIT
SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
*/

/*
; RP2350_io_bank0.
; ================

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     RP2350_io_bank0 equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// IO_BANK0 address definitions
// ----------------------------

typedef struct {
    volatile    uint32_t    GPIO0_STATUS;
    volatile    uint32_t    GPIO0_CTRL;
    volatile    uint32_t    GPIO1_STATUS;
    volatile    uint32_t    GPIO1_CTRL;
    volatile    uint32_t    GPIO2_STATUS;
    volatile    uint32_t    GPIO2_CTRL;
    volatile    uint32_t    GPIO3_STATUS;
    volatile    uint32_t    GPIO3_CTRL;
    volatile    uint32_t    GPIO4_STATUS;
    volatile    uint32_t    GPIO4_CTRL;
    volatile    uint32_t    GPIO5_STATUS;
    volatile    uint32_t    GPIO5_CTRL;
    volatile    uint32_t    GPIO6_STATUS;
    volatile    uint32_t    GPIO6_CTRL;
    volatile    uint32_t    GPIO7_STATUS;
    volatile    uint32_t    GPIO7_CTRL;
    volatile    uint32_t    GPIO8_STATUS;
    volatile    uint32_t    GPIO8_CTRL;
    volatile    uint32_t    GPIO9_STATUS;
    volatile    uint32_t    GPIO9_CTRL;
    volatile    uint32_t    GPIO10_STATUS;
    volatile    uint32_t    GPIO10_CTRL;
    volatile    uint32_t    GPIO11_STATUS;
    volatile    uint32_t    GPIO11_CTRL;
    volatile    uint32_t    GPIO12_STATUS;
    volatile    uint32_t    GPIO12_CTRL;
    volatile    uint32_t    GPIO13_STATUS;
    volatile    uint32_t    GPIO13_CTRL;
    volatile    uint32_t    GPIO14_STATUS;
    volatile    uint32_t    GPIO14_CTRL;
    volatile    uint32_t    GPIO15_STATUS;
    volatile    uint32_t    GPIO15_CTRL;
    volatile    uint32_t    GPIO16_STATUS;
    volatile    uint32_t    GPIO16_CTRL;
    volatile    uint32_t    GPIO17_STATUS;
    volatile    uint32_t    GPIO17_CTRL;
    volatile    uint32_t    GPIO18_STATUS;
    volatile    uint32_t    GPIO18_CTRL;
    volatile    uint32_t    GPIO19_STATUS;
    volatile    uint32_t    GPIO19_CTRL;
    volatile    uint32_t    GPIO20_STATUS;
    volatile    uint32_t    GPIO20_CTRL;
    volatile    uint32_t    GPIO21_STATUS;
    volatile    uint32_t    GPIO21_CTRL;
    volatile    uint32_t    GPIO22_STATUS;
    volatile    uint32_t    GPIO22_CTRL;
    volatile    uint32_t    GPIO23_STATUS;
    volatile    uint32_t    GPIO23_CTRL;
    volatile    uint32_t    GPIO24_STATUS;
    volatile    uint32_t    GPIO24_CTRL;
    volatile    uint32_t    GPIO25_STATUS;
    volatile    uint32_t    GPIO25_CTRL;
    volatile    uint32_t    GPIO26_STATUS;
    volatile    uint32_t    GPIO26_CTRL;
    volatile    uint32_t    GPIO27_STATUS;
    volatile    uint32_t    GPIO27_CTRL;
    volatile    uint32_t    GPIO28_STATUS;
    volatile    uint32_t    GPIO28_CTRL;
    volatile    uint32_t    GPIO29_STATUS;
    volatile    uint32_t    GPIO29_CTRL;
    volatile    uint32_t    GPIO30_STATUS;
    volatile    uint32_t    GPIO30_CTRL;
    volatile    uint32_t    GPIO31_STATUS;
    volatile    uint32_t    GPIO31_CTRL;
    volatile    uint32_t    GPIO32_STATUS;
    volatile    uint32_t    GPIO32_CTRL;
    volatile    uint32_t    GPIO33_STATUS;
    volatile    uint32_t    GPIO33_CTRL;
    volatile    uint32_t    GPIO34_STATUS;
    volatile    uint32_t    GPIO34_CTRL;
    volatile    uint32_t    GPIO35_STATUS;
    volatile    uint32_t    GPIO35_CTRL;
    volatile    uint32_t    GPIO36_STATUS;
    volatile    uint32_t    GPIO36_CTRL;
    volatile    uint32_t    GPIO37_STATUS;
    volatile    uint32_t    GPIO37_CTRL;
    volatile    uint32_t    GPIO38_STATUS;
    volatile    uint32_t    GPIO38_CTRL;
    volatile    uint32_t    GPIO39_STATUS;
    volatile    uint32_t    GPIO39_CTRL;
    volatile    uint32_t    GPIO40_STATUS;
    volatile    uint32_t    GPIO40_CTRL;
    volatile    uint32_t    GPIO41_STATUS;
    volatile    uint32_t    GPIO41_CTRL;
    volatile    uint32_t    GPIO42_STATUS;
    volatile    uint32_t    GPIO42_CTRL;
    volatile    uint32_t    GPIO43_STATUS;
    volatile    uint32_t    GPIO43_CTRL;
    volatile    uint32_t    GPIO44_STATUS;
    volatile    uint32_t    GPIO44_CTRL;
    volatile    uint32_t    GPIO45_STATUS;
    volatile    uint32_t    GPIO45_CTRL;
    volatile    uint32_t    GPIO46_STATUS;
    volatile    uint32_t    GPIO46_CTRL;
    volatile    uint32_t    GPIO47_STATUS;
    volatile    uint32_t    GPIO47_CTRL;
    volatile    uint32_t    RESERVED0[32];
    volatile    uint32_t    IRQSUMMARY_PROC0_SECURE0;
    volatile    uint32_t    IRQSUMMARY_PROC0_SECURE1;
    volatile    uint32_t    IRQSUMMARY_PROC0_NONSECURE0;
    volatile    uint32_t    IRQSUMMARY_PROC0_NONSECURE1;
    volatile    uint32_t    IRQSUMMARY_PROC1_SECURE0;
    volatile    uint32_t    IRQSUMMARY_PROC1_SECURE1;
    volatile    uint32_t    IRQSUMMARY_PROC1_NONSECURE0;
    volatile    uint32_t    IRQSUMMARY_PROC1_NONSECURE1;
    volatile    uint32_t    IRQSUMMARY_DORMANT_WAKE_SECURE0;
    volatile    uint32_t    IRQSUMMARY_DORMANT_WAKE_SECURE1;
    volatile    uint32_t    IRQSUMMARY_DORMANT_WAKE_NONSECURE0;
    volatile    uint32_t    IRQSUMMARY_DORMANT_WAKE_NONSECURE1;
    volatile    uint32_t    INTR0;
    volatile    uint32_t    INTR1;
    volatile    uint32_t    INTR2;
    volatile    uint32_t    INTR3;
    volatile    uint32_t    INTR4;
    volatile    uint32_t    INTR5;
    volatile    uint32_t    PROC0_INTE0;
    volatile    uint32_t    PROC0_INTE1;
    volatile    uint32_t    PROC0_INTE2;
    volatile    uint32_t    PROC0_INTE3;
    volatile    uint32_t    PROC0_INTE4;
    volatile    uint32_t    PROC0_INTE5;
    volatile    uint32_t    PROC0_INTF0;
    volatile    uint32_t    PROC0_INTF1;
    volatile    uint32_t    PROC0_INTF2;
    volatile    uint32_t    PROC0_INTF3;
    volatile    uint32_t    PROC0_INTF4;
    volatile    uint32_t    PROC0_INTF5;
    volatile    uint32_t    PROC0_INTS0;
    volatile    uint32_t    PROC0_INTS1;
    volatile    uint32_t    PROC0_INTS2;
    volatile    uint32_t    PROC0_INTS3;
    volatile    uint32_t    PROC0_INTS4;
    volatile    uint32_t    PROC0_INTS5;
    volatile    uint32_t    PROC1_INTE0;
    volatile    uint32_t    PROC1_INTE1;
    volatile    uint32_t    PROC1_INTE2;
    volatile    uint32_t    PROC1_INTE3;
    volatile    uint32_t    PROC1_INTE4;
    volatile    uint32_t    PROC1_INTE5;
    volatile    uint32_t    PROC1_INTF0;
    volatile    uint32_t    PROC1_INTF1;
    volatile    uint32_t    PROC1_INTF2;
    volatile    uint32_t    PROC1_INTF3;
    volatile    uint32_t    PROC1_INTF4;
    volatile    uint32_t    PROC1_INTF5;
    volatile    uint32_t    PROC1_INTS0;
    volatile    uint32_t    PROC1_INTS1;
    volatile    uint32_t    PROC1_INTS2;
    volatile    uint32_t    PROC1_INTS3;
    volatile    uint32_t    PROC1_INTS4;
    volatile    uint32_t    PROC1_INTS5;
    volatile    uint32_t    DORMANT_WAKE_INTE0;
    volatile    uint32_t    DORMANT_WAKE_INTE1;
    volatile    uint32_t    DORMANT_WAKE_INTE2;
    volatile    uint32_t    DORMANT_WAKE_INTE3;
    volatile    uint32_t    DORMANT_WAKE_INTE4;
    volatile    uint32_t    DORMANT_WAKE_INTE5;
    volatile    uint32_t    DORMANT_WAKE_INTF0;
    volatile    uint32_t    DORMANT_WAKE_INTF1;
    volatile    uint32_t    DORMANT_WAKE_INTF2;
    volatile    uint32_t    DORMANT_WAKE_INTF3;
    volatile    uint32_t    DORMANT_WAKE_INTF4;
    volatile    uint32_t    DORMANT_WAKE_INTF5;
    volatile    uint32_t    DORMANT_WAKE_INTS0;
    volatile    uint32_t    DORMANT_WAKE_INTS1;
    volatile    uint32_t    DORMANT_WAKE_INTS2;
    volatile    uint32_t    DORMANT_WAKE_INTS3;
    volatile    uint32_t    DORMANT_WAKE_INTS4;
    volatile    uint32_t    DORMANT_WAKE_INTS5;
} IO_BANK0_TypeDef;

#ifdef __cplusplus
#define IO_BANK0_NS reinterpret_cast<IO_BANK0_TypeDef *>(0x40028000U)
#define IO_BANK0_S  reinterpret_cast<IO_BANK0_TypeDef *>(0x40028000U)
#else
#define IO_BANK0_NS ((IO_BANK0_TypeDef *)0x40028000U)
#define IO_BANK0_S  ((IO_BANK0_TypeDef *)0x40028000U)
#endif

// GPIO0_STATUS Configuration

#define IO_BANK0_GPIO0_STATUS_OUTTOPAD                              (0x1U<<9)
#define IO_BANK0_GPIO0_STATUS_OETOPAD                               (0x1U<<13)
#define IO_BANK0_GPIO0_STATUS_INFROMPAD                             (0x1U<<17)
#define IO_BANK0_GPIO0_STATUS_IRQTOPROC                             (0x1U<<26)

