Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_io_bank0.h
#define IO_BANK0_GPIO11_CTRL_FUNCSEL                                (0x1FU<<0)
#define IO_BANK0_GPIO11_CTRL_FUNCSEL_0                              (0x1U<<0)
#define IO_BANK0_GPIO11_CTRL_OUTOVER                                (0x3U<<12)
#define IO_BANK0_GPIO11_CTRL_OUTOVER_0                              (0x1U<<12)
#define IO_BANK0_GPIO11_CTRL_OEOVER                                 (0x3U<<14)
#define IO_BANK0_GPIO11_CTRL_OEOVER_0                               (0x1U<<14)
#define IO_BANK0_GPIO11_CTRL_INOVER                                 (0x3U<<16)
#define IO_BANK0_GPIO11_CTRL_INOVER_0                               (0x1U<<16)
#define IO_BANK0_GPIO11_CTRL_IRQOVER                                (0x3U<<28)
#define IO_BANK0_GPIO11_CTRL_IRQOVER_0                              (0x1U<<28)
#define IO_BANK0_GPIO11_CTRL_FUNCSEL_SPI1_TX                        (0x1U<<0)
#define IO_BANK0_GPIO11_CTRL_FUNCSEL_UART1_RTS                      (0x2U<<0)
#define IO_BANK0_GPIO11_CTRL_FUNCSEL_I2C1_SCL                       (0x3U<<0)
#define IO_BANK0_GPIO11_CTRL_FUNCSEL_PWM_B_5                        (0x4U<<0)
#define IO_BANK0_GPIO11_CTRL_FUNCSEL_SIOB_PROC_11                   (0x5U<<0)
#define IO_BANK0_GPIO11_CTRL_FUNCSEL_PIO0_11                        (0x6U<<0)
#define IO_BANK0_GPIO11_CTRL_FUNCSEL_PIO1_11                        (0x7U<<0)
#define IO_BANK0_GPIO11_CTRL_FUNCSEL_PIO2_11                        (0x8U<<0)
#define IO_BANK0_GPIO11_CTRL_FUNCSEL_USB_MUXING_VBUS_EN             (0xAU<<0)
#define IO_BANK0_GPIO11_CTRL_FUNCSEL_UART1_RX                       (0xBU<<0)
#define IO_BANK0_GPIO11_CTRL_FUNCSEL_NULL                           (0x1FU<<0)
#define IO_BANK0_GPIO11_CTRL_OUTOVER_NORMAL                         (0x0U<<12)
#define IO_BANK0_GPIO11_CTRL_OUTOVER_INVERT                         (0x1U<<12)
#define IO_BANK0_GPIO11_CTRL_OUTOVER_LOW                            (0x2U<<12)
#define IO_BANK0_GPIO11_CTRL_OUTOVER_HIGH                           (0x3U<<12)
#define IO_BANK0_GPIO11_CTRL_OEOVER_NORMAL                          (0x0U<<14)
#define IO_BANK0_GPIO11_CTRL_OEOVER_INVERT                          (0x1U<<14)
#define IO_BANK0_GPIO11_CTRL_OEOVER_DISABLE                         (0x2U<<14)
#define IO_BANK0_GPIO11_CTRL_OEOVER_ENABLE                          (0x3U<<14)
#define IO_BANK0_GPIO11_CTRL_INOVER_NORMAL                          (0x0U<<16)
#define IO_BANK0_GPIO11_CTRL_INOVER_INVERT                          (0x1U<<16)
#define IO_BANK0_GPIO11_CTRL_INOVER_LOW                             (0x2U<<16)
#define IO_BANK0_GPIO11_CTRL_INOVER_HIGH                            (0x3U<<16)
#define IO_BANK0_GPIO11_CTRL_IRQOVER_NORMAL                         (0x0U<<28)
#define IO_BANK0_GPIO11_CTRL_IRQOVER_INVERT                         (0x1U<<28)
#define IO_BANK0_GPIO11_CTRL_IRQOVER_LOW                            (0x2U<<28)
#define IO_BANK0_GPIO11_CTRL_IRQOVER_HIGH                           (0x3U<<28)

// GPIO12_STATUS Configuration

#define IO_BANK0_GPIO12_STATUS_OUTTOPAD                             (0x1U<<9)
#define IO_BANK0_GPIO12_STATUS_OETOPAD                              (0x1U<<13)
#define IO_BANK0_GPIO12_STATUS_INFROMPAD                            (0x1U<<17)
#define IO_BANK0_GPIO12_STATUS_IRQTOPROC                            (0x1U<<26)

// GPIO12_CTRL Configuration

#define IO_BANK0_GPIO12_CTRL_FUNCSEL                                (0x1FU<<0)
#define IO_BANK0_GPIO12_CTRL_FUNCSEL_0                              (0x1U<<0)
#define IO_BANK0_GPIO12_CTRL_OUTOVER                                (0x3U<<12)
#define IO_BANK0_GPIO12_CTRL_OUTOVER_0                              (0x1U<<12)
#define IO_BANK0_GPIO12_CTRL_OEOVER                                 (0x3U<<14)
#define IO_BANK0_GPIO12_CTRL_OEOVER_0                               (0x1U<<14)
#define IO_BANK0_GPIO12_CTRL_INOVER                                 (0x3U<<16)
#define IO_BANK0_GPIO12_CTRL_INOVER_0                               (0x1U<<16)
#define IO_BANK0_GPIO12_CTRL_IRQOVER                                (0x3U<<28)
#define IO_BANK0_GPIO12_CTRL_IRQOVER_0                              (0x1U<<28)
#define IO_BANK0_GPIO12_CTRL_FUNCSEL_HSTX_0                         (0x0U<<0)
#define IO_BANK0_GPIO12_CTRL_FUNCSEL_SPI1_RX                        (0x1U<<0)
#define IO_BANK0_GPIO12_CTRL_FUNCSEL_UART0_TX                       (0x2U<<0)
#define IO_BANK0_GPIO12_CTRL_FUNCSEL_I2C0_SDA                       (0x3U<<0)
#define IO_BANK0_GPIO12_CTRL_FUNCSEL_PWM_A_6                        (0x4U<<0)
#define IO_BANK0_GPIO12_CTRL_FUNCSEL_SIOB_PROC_12                   (0x5U<<0)
#define IO_BANK0_GPIO12_CTRL_FUNCSEL_PIO0_12                        (0x6U<<0)
#define IO_BANK0_GPIO12_CTRL_FUNCSEL_PIO1_12                        (0x7U<<0)
#define IO_BANK0_GPIO12_CTRL_FUNCSEL_PIO2_12                        (0x8U<<0)
#define IO_BANK0_GPIO12_CTRL_FUNCSEL_CLOCKS_GPIN_0                  (0x9U<<0)
#define IO_BANK0_GPIO12_CTRL_FUNCSEL_USB_MUXING_OVERCURR_DETECT     (0xAU<<0)
#define IO_BANK0_GPIO12_CTRL_FUNCSEL_NULL                           (0x1FU<<0)
#define IO_BANK0_GPIO12_CTRL_OUTOVER_NORMAL                         (0x0U<<12)
#define IO_BANK0_GPIO12_CTRL_OUTOVER_INVERT                         (0x1U<<12)
#define IO_BANK0_GPIO12_CTRL_OUTOVER_LOW                            (0x2U<<12)
#define IO_BANK0_GPIO12_CTRL_OUTOVER_HIGH                           (0x3U<<12)
#define IO_BANK0_GPIO12_CTRL_OEOVER_NORMAL                          (0x0U<<14)
#define IO_BANK0_GPIO12_CTRL_OEOVER_INVERT                          (0x1U<<14)
#define IO_BANK0_GPIO12_CTRL_OEOVER_DISABLE                         (0x2U<<14)
#define IO_BANK0_GPIO12_CTRL_OEOVER_ENABLE                          (0x3U<<14)
#define IO_BANK0_GPIO12_CTRL_INOVER_NORMAL                          (0x0U<<16)
#define IO_BANK0_GPIO12_CTRL_INOVER_INVERT                          (0x1U<<16)
#define IO_BANK0_GPIO12_CTRL_INOVER_LOW                             (0x2U<<16)
#define IO_BANK0_GPIO12_CTRL_INOVER_HIGH                            (0x3U<<16)
#define IO_BANK0_GPIO12_CTRL_IRQOVER_NORMAL                         (0x0U<<28)
#define IO_BANK0_GPIO12_CTRL_IRQOVER_INVERT                         (0x1U<<28)
#define IO_BANK0_GPIO12_CTRL_IRQOVER_LOW                            (0x2U<<28)
#define IO_BANK0_GPIO12_CTRL_IRQOVER_HIGH                           (0x3U<<28)

// GPIO13_STATUS Configuration

#define IO_BANK0_GPIO13_STATUS_OUTTOPAD                             (0x1U<<9)
#define IO_BANK0_GPIO13_STATUS_OETOPAD                              (0x1U<<13)
#define IO_BANK0_GPIO13_STATUS_INFROMPAD                            (0x1U<<17)
#define IO_BANK0_GPIO13_STATUS_IRQTOPROC                            (0x1U<<26)

// GPIO13_CTRL Configuration

#define IO_BANK0_GPIO13_CTRL_FUNCSEL                                (0x1FU<<0)
#define IO_BANK0_GPIO13_CTRL_FUNCSEL_0                              (0x1U<<0)
#define IO_BANK0_GPIO13_CTRL_OUTOVER                                (0x3U<<12)
#define IO_BANK0_GPIO13_CTRL_OUTOVER_0                              (0x1U<<12)
#define IO_BANK0_GPIO13_CTRL_OEOVER                                 (0x3U<<14)
#define IO_BANK0_GPIO13_CTRL_OEOVER_0                               (0x1U<<14)
#define IO_BANK0_GPIO13_CTRL_INOVER                                 (0x3U<<16)
#define IO_BANK0_GPIO13_CTRL_INOVER_0                               (0x1U<<16)
#define IO_BANK0_GPIO13_CTRL_IRQOVER                                (0x3U<<28)
#define IO_BANK0_GPIO13_CTRL_IRQOVER_0                              (0x1U<<28)
#define IO_BANK0_GPIO13_CTRL_FUNCSEL_HSTX_1                         (0x0U<<0)
#define IO_BANK0_GPIO13_CTRL_FUNCSEL_SPI1_SS_N                      (0x1U<<0)
#define IO_BANK0_GPIO13_CTRL_FUNCSEL_UART0_RX                       (0x2U<<0)
#define IO_BANK0_GPIO13_CTRL_FUNCSEL_I2C0_SCL                       (0x3U<<0)
#define IO_BANK0_GPIO13_CTRL_FUNCSEL_PWM_B_6                        (0x4U<<0)
#define IO_BANK0_GPIO13_CTRL_FUNCSEL_SIOB_PROC_13                   (0x5U<<0)
#define IO_BANK0_GPIO13_CTRL_FUNCSEL_PIO0_13                        (0x6U<<0)
#define IO_BANK0_GPIO13_CTRL_FUNCSEL_PIO1_13                        (0x7U<<0)
#define IO_BANK0_GPIO13_CTRL_FUNCSEL_PIO2_13                        (0x8U<<0)
#define IO_BANK0_GPIO13_CTRL_FUNCSEL_CLOCKS_GPOUT_0                 (0x9U<<0)
#define IO_BANK0_GPIO13_CTRL_FUNCSEL_USB_MUXING_VBUS_DETECT         (0xAU<<0)
#define IO_BANK0_GPIO13_CTRL_FUNCSEL_NULL                           (0x1FU<<0)
#define IO_BANK0_GPIO13_CTRL_OUTOVER_NORMAL                         (0x0U<<12)
#define IO_BANK0_GPIO13_CTRL_OUTOVER_INVERT                         (0x1U<<12)
#define IO_BANK0_GPIO13_CTRL_OUTOVER_LOW                            (0x2U<<12)
#define IO_BANK0_GPIO13_CTRL_OUTOVER_HIGH                           (0x3U<<12)
#define IO_BANK0_GPIO13_CTRL_OEOVER_NORMAL                          (0x0U<<14)
#define IO_BANK0_GPIO13_CTRL_OEOVER_INVERT                          (0x1U<<14)
#define IO_BANK0_GPIO13_CTRL_OEOVER_DISABLE                         (0x2U<<14)
#define IO_BANK0_GPIO13_CTRL_OEOVER_ENABLE                          (0x3U<<14)
#define IO_BANK0_GPIO13_CTRL_INOVER_NORMAL                          (0x0U<<16)
#define IO_BANK0_GPIO13_CTRL_INOVER_INVERT                          (0x1U<<16)
#define IO_BANK0_GPIO13_CTRL_INOVER_LOW                             (0x2U<<16)
#define IO_BANK0_GPIO13_CTRL_INOVER_HIGH                            (0x3U<<16)
#define IO_BANK0_GPIO13_CTRL_IRQOVER_NORMAL                         (0x0U<<28)
#define IO_BANK0_GPIO13_CTRL_IRQOVER_INVERT                         (0x1U<<28)
#define IO_BANK0_GPIO13_CTRL_IRQOVER_LOW                            (0x2U<<28)
#define IO_BANK0_GPIO13_CTRL_IRQOVER_HIGH                           (0x3U<<28)

// GPIO14_STATUS Configuration

#define IO_BANK0_GPIO14_STATUS_OUTTOPAD                             (0x1U<<9)
#define IO_BANK0_GPIO14_STATUS_OETOPAD                              (0x1U<<13)
#define IO_BANK0_GPIO14_STATUS_INFROMPAD                            (0x1U<<17)
#define IO_BANK0_GPIO14_STATUS_IRQTOPROC                            (0x1U<<26)

// GPIO14_CTRL Configuration

#define IO_BANK0_GPIO14_CTRL_FUNCSEL                                (0x1FU<<0)
#define IO_BANK0_GPIO14_CTRL_FUNCSEL_0                              (0x1U<<0)
#define IO_BANK0_GPIO14_CTRL_OUTOVER                                (0x3U<<12)
#define IO_BANK0_GPIO14_CTRL_OUTOVER_0                              (0x1U<<12)
#define IO_BANK0_GPIO14_CTRL_OEOVER                                 (0x3U<<14)
#define IO_BANK0_GPIO14_CTRL_OEOVER_0                               (0x1U<<14)
#define IO_BANK0_GPIO14_CTRL_INOVER                                 (0x3U<<16)
#define IO_BANK0_GPIO14_CTRL_INOVER_0                               (0x1U<<16)
#define IO_BANK0_GPIO14_CTRL_IRQOVER                                (0x3U<<28)
#define IO_BANK0_GPIO14_CTRL_IRQOVER_0                              (0x1U<<28)
#define IO_BANK0_GPIO14_CTRL_FUNCSEL_HSTX_2                         (0x0U<<0)
#define IO_BANK0_GPIO14_CTRL_FUNCSEL_SPI1_SCLK                      (0x1U<<0)
#define IO_BANK0_GPIO14_CTRL_FUNCSEL_UART0_CTS                      (0x2U<<0)
#define IO_BANK0_GPIO14_CTRL_FUNCSEL_I2C1_SDA                       (0x3U<<0)
#define IO_BANK0_GPIO14_CTRL_FUNCSEL_PWM_A_7                        (0x4U<<0)
#define IO_BANK0_GPIO14_CTRL_FUNCSEL_SIOB_PROC_14                   (0x5U<<0)
#define IO_BANK0_GPIO14_CTRL_FUNCSEL_PIO0_14                        (0x6U<<0)
#define IO_BANK0_GPIO14_CTRL_FUNCSEL_PIO1_14                        (0x7U<<0)
#define IO_BANK0_GPIO14_CTRL_FUNCSEL_PIO2_14                        (0x8U<<0)
#define IO_BANK0_GPIO14_CTRL_FUNCSEL_CLOCKS_GPIN_1                  (0x9U<<0)
#define IO_BANK0_GPIO14_CTRL_FUNCSEL_USB_MUXING_VBUS_EN             (0xAU<<0)
#define IO_BANK0_GPIO14_CTRL_FUNCSEL_UART0_TX                       (0xBU<<0)
#define IO_BANK0_GPIO14_CTRL_FUNCSEL_NULL                           (0x1FU<<0)
#define IO_BANK0_GPIO14_CTRL_OUTOVER_NORMAL                         (0x0U<<12)
#define IO_BANK0_GPIO14_CTRL_OUTOVER_INVERT                         (0x1U<<12)
#define IO_BANK0_GPIO14_CTRL_OUTOVER_LOW                            (0x2U<<12)
#define IO_BANK0_GPIO14_CTRL_OUTOVER_HIGH                           (0x3U<<12)
#define IO_BANK0_GPIO14_CTRL_OEOVER_NORMAL                          (0x0U<<14)
#define IO_BANK0_GPIO14_CTRL_OEOVER_INVERT                          (0x1U<<14)
#define IO_BANK0_GPIO14_CTRL_OEOVER_DISABLE                         (0x2U<<14)
#define IO_BANK0_GPIO14_CTRL_OEOVER_ENABLE                          (0x3U<<14)
#define IO_BANK0_GPIO14_CTRL_INOVER_NORMAL                          (0x0U<<16)
#define IO_BANK0_GPIO14_CTRL_INOVER_INVERT                          (0x1U<<16)
#define IO_BANK0_GPIO14_CTRL_INOVER_LOW                             (0x2U<<16)
#define IO_BANK0_GPIO14_CTRL_INOVER_HIGH                            (0x3U<<16)
#define IO_BANK0_GPIO14_CTRL_IRQOVER_NORMAL                         (0x0U<<28)
#define IO_BANK0_GPIO14_CTRL_IRQOVER_INVERT                         (0x1U<<28)
#define IO_BANK0_GPIO14_CTRL_IRQOVER_LOW                            (0x2U<<28)
#define IO_BANK0_GPIO14_CTRL_IRQOVER_HIGH                           (0x3U<<28)

// GPIO15_STATUS Configuration

#define IO_BANK0_GPIO15_STATUS_OUTTOPAD                             (0x1U<<9)
#define IO_BANK0_GPIO15_STATUS_OETOPAD                              (0x1U<<13)
#define IO_BANK0_GPIO15_STATUS_INFROMPAD                            (0x1U<<17)
#define IO_BANK0_GPIO15_STATUS_IRQTOPROC                            (0x1U<<26)

