Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_io_bank0.h
// GPIO17_CTRL Configuration

#define IO_BANK0_GPIO17_CTRL_FUNCSEL                                (0x1FU<<0)
#define IO_BANK0_GPIO17_CTRL_FUNCSEL_0                              (0x1U<<0)
#define IO_BANK0_GPIO17_CTRL_OUTOVER                                (0x3U<<12)
#define IO_BANK0_GPIO17_CTRL_OUTOVER_0                              (0x1U<<12)
#define IO_BANK0_GPIO17_CTRL_OEOVER                                 (0x3U<<14)
#define IO_BANK0_GPIO17_CTRL_OEOVER_0                               (0x1U<<14)
#define IO_BANK0_GPIO17_CTRL_INOVER                                 (0x3U<<16)
#define IO_BANK0_GPIO17_CTRL_INOVER_0                               (0x1U<<16)
#define IO_BANK0_GPIO17_CTRL_IRQOVER                                (0x3U<<28)
#define IO_BANK0_GPIO17_CTRL_IRQOVER_0                              (0x1U<<28)
#define IO_BANK0_GPIO17_CTRL_FUNCSEL_HSTX_5                         (0x0U<<0)
#define IO_BANK0_GPIO17_CTRL_FUNCSEL_SPI0_SS_N                      (0x1U<<0)
#define IO_BANK0_GPIO17_CTRL_FUNCSEL_UART0_RX                       (0x2U<<0)
#define IO_BANK0_GPIO17_CTRL_FUNCSEL_I2C0_SCL                       (0x3U<<0)
#define IO_BANK0_GPIO17_CTRL_FUNCSEL_PWM_B_0                        (0x4U<<0)
#define IO_BANK0_GPIO17_CTRL_FUNCSEL_SIOB_PROC_17                   (0x5U<<0)
#define IO_BANK0_GPIO17_CTRL_FUNCSEL_PIO0_17                        (0x6U<<0)
#define IO_BANK0_GPIO17_CTRL_FUNCSEL_PIO1_17                        (0x7U<<0)
#define IO_BANK0_GPIO17_CTRL_FUNCSEL_PIO2_17                        (0x8U<<0)
#define IO_BANK0_GPIO17_CTRL_FUNCSEL_USB_MUXING_VBUS_EN             (0xAU<<0)
#define IO_BANK0_GPIO17_CTRL_FUNCSEL_NULL                           (0x1FU<<0)
#define IO_BANK0_GPIO17_CTRL_OUTOVER_NORMAL                         (0x0U<<12)
#define IO_BANK0_GPIO17_CTRL_OUTOVER_INVERT                         (0x1U<<12)
#define IO_BANK0_GPIO17_CTRL_OUTOVER_LOW                            (0x2U<<12)
#define IO_BANK0_GPIO17_CTRL_OUTOVER_HIGH                           (0x3U<<12)
#define IO_BANK0_GPIO17_CTRL_OEOVER_NORMAL                          (0x0U<<14)
#define IO_BANK0_GPIO17_CTRL_OEOVER_INVERT                          (0x1U<<14)
#define IO_BANK0_GPIO17_CTRL_OEOVER_DISABLE                         (0x2U<<14)
#define IO_BANK0_GPIO17_CTRL_OEOVER_ENABLE                          (0x3U<<14)
#define IO_BANK0_GPIO17_CTRL_INOVER_NORMAL                          (0x0U<<16)
#define IO_BANK0_GPIO17_CTRL_INOVER_INVERT                          (0x1U<<16)
#define IO_BANK0_GPIO17_CTRL_INOVER_LOW                             (0x2U<<16)
#define IO_BANK0_GPIO17_CTRL_INOVER_HIGH                            (0x3U<<16)
#define IO_BANK0_GPIO17_CTRL_IRQOVER_NORMAL                         (0x0U<<28)
#define IO_BANK0_GPIO17_CTRL_IRQOVER_INVERT                         (0x1U<<28)
#define IO_BANK0_GPIO17_CTRL_IRQOVER_LOW                            (0x2U<<28)
#define IO_BANK0_GPIO17_CTRL_IRQOVER_HIGH                           (0x3U<<28)

// GPIO18_STATUS Configuration

#define IO_BANK0_GPIO18_STATUS_OUTTOPAD                             (0x1U<<9)
#define IO_BANK0_GPIO18_STATUS_OETOPAD                              (0x1U<<13)
#define IO_BANK0_GPIO18_STATUS_INFROMPAD                            (0x1U<<17)
#define IO_BANK0_GPIO18_STATUS_IRQTOPROC                            (0x1U<<26)

// GPIO18_CTRL Configuration

#define IO_BANK0_GPIO18_CTRL_FUNCSEL                                (0x1FU<<0)
#define IO_BANK0_GPIO18_CTRL_FUNCSEL_0                              (0x1U<<0)
#define IO_BANK0_GPIO18_CTRL_OUTOVER                                (0x3U<<12)
#define IO_BANK0_GPIO18_CTRL_OUTOVER_0                              (0x1U<<12)
#define IO_BANK0_GPIO18_CTRL_OEOVER                                 (0x3U<<14)
#define IO_BANK0_GPIO18_CTRL_OEOVER_0                               (0x1U<<14)
#define IO_BANK0_GPIO18_CTRL_INOVER                                 (0x3U<<16)
#define IO_BANK0_GPIO18_CTRL_INOVER_0                               (0x1U<<16)
#define IO_BANK0_GPIO18_CTRL_IRQOVER                                (0x3U<<28)
#define IO_BANK0_GPIO18_CTRL_IRQOVER_0                              (0x1U<<28)
#define IO_BANK0_GPIO18_CTRL_FUNCSEL_HSTX_6                         (0x0U<<0)
#define IO_BANK0_GPIO18_CTRL_FUNCSEL_SPI0_SCLK                      (0x1U<<0)
#define IO_BANK0_GPIO18_CTRL_FUNCSEL_UART0_CTS                      (0x2U<<0)
#define IO_BANK0_GPIO18_CTRL_FUNCSEL_I2C1_SDA                       (0x3U<<0)
#define IO_BANK0_GPIO18_CTRL_FUNCSEL_PWM_A_1                        (0x4U<<0)
#define IO_BANK0_GPIO18_CTRL_FUNCSEL_SIOB_PROC_18                   (0x5U<<0)
#define IO_BANK0_GPIO18_CTRL_FUNCSEL_PIO0_18                        (0x6U<<0)
#define IO_BANK0_GPIO18_CTRL_FUNCSEL_PIO1_18                        (0x7U<<0)
#define IO_BANK0_GPIO18_CTRL_FUNCSEL_PIO2_18                        (0x8U<<0)
#define IO_BANK0_GPIO18_CTRL_FUNCSEL_USB_MUXING_OVERCURR_DETECT     (0xAU<<0)
#define IO_BANK0_GPIO18_CTRL_FUNCSEL_UART0_TX                       (0xBU<<0)
#define IO_BANK0_GPIO18_CTRL_FUNCSEL_NULL                           (0x1FU<<0)
#define IO_BANK0_GPIO18_CTRL_OUTOVER_NORMAL                         (0x0U<<12)
#define IO_BANK0_GPIO18_CTRL_OUTOVER_INVERT                         (0x1U<<12)
#define IO_BANK0_GPIO18_CTRL_OUTOVER_LOW                            (0x2U<<12)
#define IO_BANK0_GPIO18_CTRL_OUTOVER_HIGH                           (0x3U<<12)
#define IO_BANK0_GPIO18_CTRL_OEOVER_NORMAL                          (0x0U<<14)
#define IO_BANK0_GPIO18_CTRL_OEOVER_INVERT                          (0x1U<<14)
#define IO_BANK0_GPIO18_CTRL_OEOVER_DISABLE                         (0x2U<<14)
#define IO_BANK0_GPIO18_CTRL_OEOVER_ENABLE                          (0x3U<<14)
#define IO_BANK0_GPIO18_CTRL_INOVER_NORMAL                          (0x0U<<16)
#define IO_BANK0_GPIO18_CTRL_INOVER_INVERT                          (0x1U<<16)
#define IO_BANK0_GPIO18_CTRL_INOVER_LOW                             (0x2U<<16)
#define IO_BANK0_GPIO18_CTRL_INOVER_HIGH                            (0x3U<<16)
#define IO_BANK0_GPIO18_CTRL_IRQOVER_NORMAL                         (0x0U<<28)
#define IO_BANK0_GPIO18_CTRL_IRQOVER_INVERT                         (0x1U<<28)
#define IO_BANK0_GPIO18_CTRL_IRQOVER_LOW                            (0x2U<<28)
#define IO_BANK0_GPIO18_CTRL_IRQOVER_HIGH                           (0x3U<<28)

// GPIO19_STATUS Configuration

#define IO_BANK0_GPIO19_STATUS_OUTTOPAD                             (0x1U<<9)
#define IO_BANK0_GPIO19_STATUS_OETOPAD                              (0x1U<<13)
#define IO_BANK0_GPIO19_STATUS_INFROMPAD                            (0x1U<<17)
#define IO_BANK0_GPIO19_STATUS_IRQTOPROC                            (0x1U<<26)

// GPIO19_CTRL Configuration

