Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_io_bank0.h
#define IO_BANK0_GPIO21_CTRL_FUNCSEL                                (0x1FU<<0)
#define IO_BANK0_GPIO21_CTRL_FUNCSEL_0                              (0x1U<<0)
#define IO_BANK0_GPIO21_CTRL_OUTOVER                                (0x3U<<12)
#define IO_BANK0_GPIO21_CTRL_OUTOVER_0                              (0x1U<<12)
#define IO_BANK0_GPIO21_CTRL_OEOVER                                 (0x3U<<14)
#define IO_BANK0_GPIO21_CTRL_OEOVER_0                               (0x1U<<14)
#define IO_BANK0_GPIO21_CTRL_INOVER                                 (0x3U<<16)
#define IO_BANK0_GPIO21_CTRL_INOVER_0                               (0x1U<<16)
#define IO_BANK0_GPIO21_CTRL_IRQOVER                                (0x3U<<28)
#define IO_BANK0_GPIO21_CTRL_IRQOVER_0                              (0x1U<<28)
#define IO_BANK0_GPIO21_CTRL_FUNCSEL_SPI0_SS_N                      (0x1U<<0)
#define IO_BANK0_GPIO21_CTRL_FUNCSEL_UART1_RX                       (0x2U<<0)
#define IO_BANK0_GPIO21_CTRL_FUNCSEL_I2C0_SCL                       (0x3U<<0)
#define IO_BANK0_GPIO21_CTRL_FUNCSEL_PWM_B_2                        (0x4U<<0)
#define IO_BANK0_GPIO21_CTRL_FUNCSEL_SIOB_PROC_21                   (0x5U<<0)
#define IO_BANK0_GPIO21_CTRL_FUNCSEL_PIO0_21                        (0x6U<<0)
#define IO_BANK0_GPIO21_CTRL_FUNCSEL_PIO1_21                        (0x7U<<0)
#define IO_BANK0_GPIO21_CTRL_FUNCSEL_PIO2_21                        (0x8U<<0)
#define IO_BANK0_GPIO21_CTRL_FUNCSEL_CLOCKS_GPOUT_0                 (0x9U<<0)
#define IO_BANK0_GPIO21_CTRL_FUNCSEL_USB_MUXING_OVERCURR_DETECT     (0xAU<<0)
#define IO_BANK0_GPIO21_CTRL_FUNCSEL_NULL                           (0x1FU<<0)
#define IO_BANK0_GPIO21_CTRL_OUTOVER_NORMAL                         (0x0U<<12)
#define IO_BANK0_GPIO21_CTRL_OUTOVER_INVERT                         (0x1U<<12)
#define IO_BANK0_GPIO21_CTRL_OUTOVER_LOW                            (0x2U<<12)
#define IO_BANK0_GPIO21_CTRL_OUTOVER_HIGH                           (0x3U<<12)
#define IO_BANK0_GPIO21_CTRL_OEOVER_NORMAL                          (0x0U<<14)
#define IO_BANK0_GPIO21_CTRL_OEOVER_INVERT                          (0x1U<<14)
#define IO_BANK0_GPIO21_CTRL_OEOVER_DISABLE                         (0x2U<<14)
#define IO_BANK0_GPIO21_CTRL_OEOVER_ENABLE                          (0x3U<<14)
#define IO_BANK0_GPIO21_CTRL_INOVER_NORMAL                          (0x0U<<16)
#define IO_BANK0_GPIO21_CTRL_INOVER_INVERT                          (0x1U<<16)
#define IO_BANK0_GPIO21_CTRL_INOVER_LOW                             (0x2U<<16)
#define IO_BANK0_GPIO21_CTRL_INOVER_HIGH                            (0x3U<<16)
#define IO_BANK0_GPIO21_CTRL_IRQOVER_NORMAL                         (0x0U<<28)
#define IO_BANK0_GPIO21_CTRL_IRQOVER_INVERT                         (0x1U<<28)
#define IO_BANK0_GPIO21_CTRL_IRQOVER_LOW                            (0x2U<<28)
#define IO_BANK0_GPIO21_CTRL_IRQOVER_HIGH                           (0x3U<<28)

// GPIO22_STATUS Configuration

#define IO_BANK0_GPIO22_STATUS_OUTTOPAD                             (0x1U<<9)
#define IO_BANK0_GPIO22_STATUS_OETOPAD                              (0x1U<<13)
#define IO_BANK0_GPIO22_STATUS_INFROMPAD                            (0x1U<<17)
#define IO_BANK0_GPIO22_STATUS_IRQTOPROC                            (0x1U<<26)

// GPIO22_CTRL Configuration

#define IO_BANK0_GPIO22_CTRL_FUNCSEL                                (0x1FU<<0)
#define IO_BANK0_GPIO22_CTRL_FUNCSEL_0                              (0x1U<<0)
#define IO_BANK0_GPIO22_CTRL_OUTOVER                                (0x3U<<12)
#define IO_BANK0_GPIO22_CTRL_OUTOVER_0                              (0x1U<<12)
#define IO_BANK0_GPIO22_CTRL_OEOVER                                 (0x3U<<14)
#define IO_BANK0_GPIO22_CTRL_OEOVER_0                               (0x1U<<14)
#define IO_BANK0_GPIO22_CTRL_INOVER                                 (0x3U<<16)
#define IO_BANK0_GPIO22_CTRL_INOVER_0                               (0x1U<<16)
#define IO_BANK0_GPIO22_CTRL_IRQOVER                                (0x3U<<28)
#define IO_BANK0_GPIO22_CTRL_IRQOVER_0                              (0x1U<<28)
#define IO_BANK0_GPIO22_CTRL_FUNCSEL_SPI0_SCLK                      (0x1U<<0)
#define IO_BANK0_GPIO22_CTRL_FUNCSEL_UART1_CTS                      (0x2U<<0)
#define IO_BANK0_GPIO22_CTRL_FUNCSEL_I2C1_SDA                       (0x3U<<0)
#define IO_BANK0_GPIO22_CTRL_FUNCSEL_PWM_A_3                        (0x4U<<0)
#define IO_BANK0_GPIO22_CTRL_FUNCSEL_SIOB_PROC_22                   (0x5U<<0)
#define IO_BANK0_GPIO22_CTRL_FUNCSEL_PIO0_22                        (0x6U<<0)
#define IO_BANK0_GPIO22_CTRL_FUNCSEL_PIO1_22                        (0x7U<<0)
#define IO_BANK0_GPIO22_CTRL_FUNCSEL_PIO2_22                        (0x8U<<0)
#define IO_BANK0_GPIO22_CTRL_FUNCSEL_CLOCKS_GPIN_1                  (0x9U<<0)
#define IO_BANK0_GPIO22_CTRL_FUNCSEL_USB_MUXING_VBUS_DETECT         (0xAU<<0)
#define IO_BANK0_GPIO22_CTRL_FUNCSEL_UART1_TX                       (0xBU<<0)
#define IO_BANK0_GPIO22_CTRL_FUNCSEL_NULL                           (0x1FU<<0)
#define IO_BANK0_GPIO22_CTRL_OUTOVER_NORMAL                         (0x0U<<12)
#define IO_BANK0_GPIO22_CTRL_OUTOVER_INVERT                         (0x1U<<12)
#define IO_BANK0_GPIO22_CTRL_OUTOVER_LOW                            (0x2U<<12)
#define IO_BANK0_GPIO22_CTRL_OUTOVER_HIGH                           (0x3U<<12)
#define IO_BANK0_GPIO22_CTRL_OEOVER_NORMAL                          (0x0U<<14)
#define IO_BANK0_GPIO22_CTRL_OEOVER_INVERT                          (0x1U<<14)
#define IO_BANK0_GPIO22_CTRL_OEOVER_DISABLE                         (0x2U<<14)
#define IO_BANK0_GPIO22_CTRL_OEOVER_ENABLE                          (0x3U<<14)
#define IO_BANK0_GPIO22_CTRL_INOVER_NORMAL                          (0x0U<<16)
#define IO_BANK0_GPIO22_CTRL_INOVER_INVERT                          (0x1U<<16)
#define IO_BANK0_GPIO22_CTRL_INOVER_LOW                             (0x2U<<16)
#define IO_BANK0_GPIO22_CTRL_INOVER_HIGH                            (0x3U<<16)
#define IO_BANK0_GPIO22_CTRL_IRQOVER_NORMAL                         (0x0U<<28)
#define IO_BANK0_GPIO22_CTRL_IRQOVER_INVERT                         (0x1U<<28)
#define IO_BANK0_GPIO22_CTRL_IRQOVER_LOW                            (0x2U<<28)
#define IO_BANK0_GPIO22_CTRL_IRQOVER_HIGH                           (0x3U<<28)

// GPIO23_STATUS Configuration

#define IO_BANK0_GPIO23_STATUS_OUTTOPAD                             (0x1U<<9)
#define IO_BANK0_GPIO23_STATUS_OETOPAD                              (0x1U<<13)
#define IO_BANK0_GPIO23_STATUS_INFROMPAD                            (0x1U<<17)
#define IO_BANK0_GPIO23_STATUS_IRQTOPROC                            (0x1U<<26)

// GPIO23_CTRL Configuration

#define IO_BANK0_GPIO23_CTRL_FUNCSEL                                (0x1FU<<0)
#define IO_BANK0_GPIO23_CTRL_FUNCSEL_0                              (0x1U<<0)
#define IO_BANK0_GPIO23_CTRL_OUTOVER                                (0x3U<<12)
#define IO_BANK0_GPIO23_CTRL_OUTOVER_0                              (0x1U<<12)
#define IO_BANK0_GPIO23_CTRL_OEOVER                                 (0x3U<<14)
#define IO_BANK0_GPIO23_CTRL_OEOVER_0                               (0x1U<<14)
#define IO_BANK0_GPIO23_CTRL_INOVER                                 (0x3U<<16)
#define IO_BANK0_GPIO23_CTRL_INOVER_0                               (0x1U<<16)
#define IO_BANK0_GPIO23_CTRL_IRQOVER                                (0x3U<<28)
#define IO_BANK0_GPIO23_CTRL_IRQOVER_0                              (0x1U<<28)
#define IO_BANK0_GPIO23_CTRL_FUNCSEL_SPI0_TX                        (0x1U<<0)
#define IO_BANK0_GPIO23_CTRL_FUNCSEL_UART1_RTS                      (0x2U<<0)
#define IO_BANK0_GPIO23_CTRL_FUNCSEL_I2C1_SCL                       (0x3U<<0)
#define IO_BANK0_GPIO23_CTRL_FUNCSEL_PWM_B_3                        (0x4U<<0)
#define IO_BANK0_GPIO23_CTRL_FUNCSEL_SIOB_PROC_23                   (0x5U<<0)
#define IO_BANK0_GPIO23_CTRL_FUNCSEL_PIO0_23                        (0x6U<<0)
#define IO_BANK0_GPIO23_CTRL_FUNCSEL_PIO1_23                        (0x7U<<0)
#define IO_BANK0_GPIO23_CTRL_FUNCSEL_PIO2_23                        (0x8U<<0)
#define IO_BANK0_GPIO23_CTRL_FUNCSEL_CLOCKS_GPOUT_1                 (0x9U<<0)
#define IO_BANK0_GPIO23_CTRL_FUNCSEL_USB_MUXING_VBUS_EN             (0xAU<<0)
#define IO_BANK0_GPIO23_CTRL_FUNCSEL_UART1_RX                       (0xBU<<0)
#define IO_BANK0_GPIO23_CTRL_FUNCSEL_NULL                           (0x1FU<<0)
#define IO_BANK0_GPIO23_CTRL_OUTOVER_NORMAL                         (0x0U<<12)
#define IO_BANK0_GPIO23_CTRL_OUTOVER_INVERT                         (0x1U<<12)
#define IO_BANK0_GPIO23_CTRL_OUTOVER_LOW                            (0x2U<<12)
#define IO_BANK0_GPIO23_CTRL_OUTOVER_HIGH                           (0x3U<<12)
#define IO_BANK0_GPIO23_CTRL_OEOVER_NORMAL                          (0x0U<<14)
#define IO_BANK0_GPIO23_CTRL_OEOVER_INVERT                          (0x1U<<14)
#define IO_BANK0_GPIO23_CTRL_OEOVER_DISABLE                         (0x2U<<14)
#define IO_BANK0_GPIO23_CTRL_OEOVER_ENABLE                          (0x3U<<14)
#define IO_BANK0_GPIO23_CTRL_INOVER_NORMAL                          (0x0U<<16)
#define IO_BANK0_GPIO23_CTRL_INOVER_INVERT                          (0x1U<<16)
#define IO_BANK0_GPIO23_CTRL_INOVER_LOW                             (0x2U<<16)
#define IO_BANK0_GPIO23_CTRL_INOVER_HIGH                            (0x3U<<16)
#define IO_BANK0_GPIO23_CTRL_IRQOVER_NORMAL                         (0x0U<<28)
#define IO_BANK0_GPIO23_CTRL_IRQOVER_INVERT                         (0x1U<<28)
#define IO_BANK0_GPIO23_CTRL_IRQOVER_LOW                            (0x2U<<28)
#define IO_BANK0_GPIO23_CTRL_IRQOVER_HIGH                           (0x3U<<28)

// GPIO24_STATUS Configuration

#define IO_BANK0_GPIO24_STATUS_OUTTOPAD                             (0x1U<<9)
#define IO_BANK0_GPIO24_STATUS_OETOPAD                              (0x1U<<13)
#define IO_BANK0_GPIO24_STATUS_INFROMPAD                            (0x1U<<17)
#define IO_BANK0_GPIO24_STATUS_IRQTOPROC                            (0x1U<<26)

// GPIO24_CTRL Configuration

#define IO_BANK0_GPIO24_CTRL_FUNCSEL                                (0x1FU<<0)
#define IO_BANK0_GPIO24_CTRL_FUNCSEL_0                              (0x1U<<0)
#define IO_BANK0_GPIO24_CTRL_OUTOVER                                (0x3U<<12)
#define IO_BANK0_GPIO24_CTRL_OUTOVER_0                              (0x1U<<12)
#define IO_BANK0_GPIO24_CTRL_OEOVER                                 (0x3U<<14)
#define IO_BANK0_GPIO24_CTRL_OEOVER_0                               (0x1U<<14)
#define IO_BANK0_GPIO24_CTRL_INOVER                                 (0x3U<<16)
#define IO_BANK0_GPIO24_CTRL_INOVER_0                               (0x1U<<16)
#define IO_BANK0_GPIO24_CTRL_IRQOVER                                (0x3U<<28)
#define IO_BANK0_GPIO24_CTRL_IRQOVER_0                              (0x1U<<28)
#define IO_BANK0_GPIO24_CTRL_FUNCSEL_SPI1_RX                        (0x1U<<0)
#define IO_BANK0_GPIO24_CTRL_FUNCSEL_UART1_TX                       (0x2U<<0)
#define IO_BANK0_GPIO24_CTRL_FUNCSEL_I2C0_SDA                       (0x3U<<0)
#define IO_BANK0_GPIO24_CTRL_FUNCSEL_PWM_A_4                        (0x4U<<0)
#define IO_BANK0_GPIO24_CTRL_FUNCSEL_SIOB_PROC_24                   (0x5U<<0)
#define IO_BANK0_GPIO24_CTRL_FUNCSEL_PIO0_24                        (0x6U<<0)
#define IO_BANK0_GPIO24_CTRL_FUNCSEL_PIO1_24                        (0x7U<<0)
#define IO_BANK0_GPIO24_CTRL_FUNCSEL_PIO2_24                        (0x8U<<0)
#define IO_BANK0_GPIO24_CTRL_FUNCSEL_CLOCKS_GPOUT_2                 (0x9U<<0)
#define IO_BANK0_GPIO24_CTRL_FUNCSEL_USB_MUXING_OVERCURR_DETECT     (0xAU<<0)
#define IO_BANK0_GPIO24_CTRL_FUNCSEL_NULL                           (0x1FU<<0)
#define IO_BANK0_GPIO24_CTRL_OUTOVER_NORMAL                         (0x0U<<12)
#define IO_BANK0_GPIO24_CTRL_OUTOVER_INVERT                         (0x1U<<12)
#define IO_BANK0_GPIO24_CTRL_OUTOVER_LOW                            (0x2U<<12)
#define IO_BANK0_GPIO24_CTRL_OUTOVER_HIGH                           (0x3U<<12)
#define IO_BANK0_GPIO24_CTRL_OEOVER_NORMAL                          (0x0U<<14)
#define IO_BANK0_GPIO24_CTRL_OEOVER_INVERT                          (0x1U<<14)
#define IO_BANK0_GPIO24_CTRL_OEOVER_DISABLE                         (0x2U<<14)
#define IO_BANK0_GPIO24_CTRL_OEOVER_ENABLE                          (0x3U<<14)
#define IO_BANK0_GPIO24_CTRL_INOVER_NORMAL                          (0x0U<<16)
#define IO_BANK0_GPIO24_CTRL_INOVER_INVERT                          (0x1U<<16)
#define IO_BANK0_GPIO24_CTRL_INOVER_LOW                             (0x2U<<16)
#define IO_BANK0_GPIO24_CTRL_INOVER_HIGH                            (0x3U<<16)
#define IO_BANK0_GPIO24_CTRL_IRQOVER_NORMAL                         (0x0U<<28)
#define IO_BANK0_GPIO24_CTRL_IRQOVER_INVERT                         (0x1U<<28)
#define IO_BANK0_GPIO24_CTRL_IRQOVER_LOW                            (0x2U<<28)
#define IO_BANK0_GPIO24_CTRL_IRQOVER_HIGH                           (0x3U<<28)

// GPIO25_STATUS Configuration

#define IO_BANK0_GPIO25_STATUS_OUTTOPAD                             (0x1U<<9)
#define IO_BANK0_GPIO25_STATUS_OETOPAD                              (0x1U<<13)
#define IO_BANK0_GPIO25_STATUS_INFROMPAD                            (0x1U<<17)
#define IO_BANK0_GPIO25_STATUS_IRQTOPROC                            (0x1U<<26)

// GPIO25_CTRL Configuration

