Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_io_bank0.h
#define IO_BANK0_GPIO38_STATUS_OUTTOPAD                             (0x1U<<9)
#define IO_BANK0_GPIO38_STATUS_OETOPAD                              (0x1U<<13)
#define IO_BANK0_GPIO38_STATUS_INFROMPAD                            (0x1U<<17)
#define IO_BANK0_GPIO38_STATUS_IRQTOPROC                            (0x1U<<26)

// GPIO38_CTRL Configuration

#define IO_BANK0_GPIO38_CTRL_FUNCSEL                                (0x1FU<<0)
#define IO_BANK0_GPIO38_CTRL_FUNCSEL_0                              (0x1U<<0)
#define IO_BANK0_GPIO38_CTRL_OUTOVER                                (0x3U<<12)
#define IO_BANK0_GPIO38_CTRL_OUTOVER_0                              (0x1U<<12)
#define IO_BANK0_GPIO38_CTRL_OEOVER                                 (0x3U<<14)
#define IO_BANK0_GPIO38_CTRL_OEOVER_0                               (0x1U<<14)
#define IO_BANK0_GPIO38_CTRL_INOVER                                 (0x3U<<16)
#define IO_BANK0_GPIO38_CTRL_INOVER_0                               (0x1U<<16)
#define IO_BANK0_GPIO38_CTRL_IRQOVER                                (0x3U<<28)
#define IO_BANK0_GPIO38_CTRL_IRQOVER_0                              (0x1U<<28)
#define IO_BANK0_GPIO38_CTRL_FUNCSEL_SPI0_SCLK                      (0x1U<<0)
#define IO_BANK0_GPIO38_CTRL_FUNCSEL_UART1_CTS                      (0x2U<<0)
#define IO_BANK0_GPIO38_CTRL_FUNCSEL_I2C1_SDA                       (0x3U<<0)
#define IO_BANK0_GPIO38_CTRL_FUNCSEL_PWM_A_11                       (0x4U<<0)
#define IO_BANK0_GPIO38_CTRL_FUNCSEL_SIOB_PROC_38                   (0x5U<<0)
#define IO_BANK0_GPIO38_CTRL_FUNCSEL_PIO0_38                        (0x6U<<0)
#define IO_BANK0_GPIO38_CTRL_FUNCSEL_PIO1_38                        (0x7U<<0)
#define IO_BANK0_GPIO38_CTRL_FUNCSEL_PIO2_38                        (0x8U<<0)
#define IO_BANK0_GPIO38_CTRL_FUNCSEL_USB_MUXING_VBUS_EN             (0xAU<<0)
#define IO_BANK0_GPIO38_CTRL_FUNCSEL_UART1_TX                       (0xBU<<0)
#define IO_BANK0_GPIO38_CTRL_FUNCSEL_NULL                           (0x1FU<<0)
#define IO_BANK0_GPIO38_CTRL_OUTOVER_NORMAL                         (0x0U<<12)
#define IO_BANK0_GPIO38_CTRL_OUTOVER_INVERT                         (0x1U<<12)
#define IO_BANK0_GPIO38_CTRL_OUTOVER_LOW                            (0x2U<<12)
#define IO_BANK0_GPIO38_CTRL_OUTOVER_HIGH                           (0x3U<<12)
#define IO_BANK0_GPIO38_CTRL_OEOVER_NORMAL                          (0x0U<<14)
#define IO_BANK0_GPIO38_CTRL_OEOVER_INVERT                          (0x1U<<14)
#define IO_BANK0_GPIO38_CTRL_OEOVER_DISABLE                         (0x2U<<14)
#define IO_BANK0_GPIO38_CTRL_OEOVER_ENABLE                          (0x3U<<14)
#define IO_BANK0_GPIO38_CTRL_INOVER_NORMAL                          (0x0U<<16)
#define IO_BANK0_GPIO38_CTRL_INOVER_INVERT                          (0x1U<<16)
#define IO_BANK0_GPIO38_CTRL_INOVER_LOW                             (0x2U<<16)
#define IO_BANK0_GPIO38_CTRL_INOVER_HIGH                            (0x3U<<16)
#define IO_BANK0_GPIO38_CTRL_IRQOVER_NORMAL                         (0x0U<<28)
#define IO_BANK0_GPIO38_CTRL_IRQOVER_INVERT                         (0x1U<<28)
#define IO_BANK0_GPIO38_CTRL_IRQOVER_LOW                            (0x2U<<28)
#define IO_BANK0_GPIO38_CTRL_IRQOVER_HIGH                           (0x3U<<28)

// GPIO39_STATUS Configuration

#define IO_BANK0_GPIO39_STATUS_OUTTOPAD                             (0x1U<<9)
#define IO_BANK0_GPIO39_STATUS_OETOPAD                              (0x1U<<13)
#define IO_BANK0_GPIO39_STATUS_INFROMPAD                            (0x1U<<17)
#define IO_BANK0_GPIO39_STATUS_IRQTOPROC                            (0x1U<<26)

// GPIO39_CTRL Configuration

#define IO_BANK0_GPIO39_CTRL_FUNCSEL                                (0x1FU<<0)
#define IO_BANK0_GPIO39_CTRL_FUNCSEL_0                              (0x1U<<0)
#define IO_BANK0_GPIO39_CTRL_OUTOVER                                (0x3U<<12)
#define IO_BANK0_GPIO39_CTRL_OUTOVER_0                              (0x1U<<12)
#define IO_BANK0_GPIO39_CTRL_OEOVER                                 (0x3U<<14)
#define IO_BANK0_GPIO39_CTRL_OEOVER_0                               (0x1U<<14)
#define IO_BANK0_GPIO39_CTRL_INOVER                                 (0x3U<<16)
#define IO_BANK0_GPIO39_CTRL_INOVER_0                               (0x1U<<16)
#define IO_BANK0_GPIO39_CTRL_IRQOVER                                (0x3U<<28)
#define IO_BANK0_GPIO39_CTRL_IRQOVER_0                              (0x1U<<28)
#define IO_BANK0_GPIO39_CTRL_FUNCSEL_SPI0_TX                        (0x1U<<0)
#define IO_BANK0_GPIO39_CTRL_FUNCSEL_UART1_RTS                      (0x2U<<0)
#define IO_BANK0_GPIO39_CTRL_FUNCSEL_I2C1_SCL                       (0x3U<<0)
#define IO_BANK0_GPIO39_CTRL_FUNCSEL_PWM_B_11                       (0x4U<<0)
#define IO_BANK0_GPIO39_CTRL_FUNCSEL_SIOB_PROC_39                   (0x5U<<0)
#define IO_BANK0_GPIO39_CTRL_FUNCSEL_PIO0_39                        (0x6U<<0)
#define IO_BANK0_GPIO39_CTRL_FUNCSEL_PIO1_39                        (0x7U<<0)
#define IO_BANK0_GPIO39_CTRL_FUNCSEL_PIO2_39                        (0x8U<<0)
#define IO_BANK0_GPIO39_CTRL_FUNCSEL_USB_MUXING_OVERCURR_DETECT     (0xAU<<0)
#define IO_BANK0_GPIO39_CTRL_FUNCSEL_UART1_RX                       (0xBU<<0)
#define IO_BANK0_GPIO39_CTRL_FUNCSEL_NULL                           (0x1FU<<0)
#define IO_BANK0_GPIO39_CTRL_OUTOVER_NORMAL                         (0x0U<<12)
#define IO_BANK0_GPIO39_CTRL_OUTOVER_INVERT                         (0x1U<<12)
#define IO_BANK0_GPIO39_CTRL_OUTOVER_LOW                            (0x2U<<12)
#define IO_BANK0_GPIO39_CTRL_OUTOVER_HIGH                           (0x3U<<12)
#define IO_BANK0_GPIO39_CTRL_OEOVER_NORMAL                          (0x0U<<14)
#define IO_BANK0_GPIO39_CTRL_OEOVER_INVERT                          (0x1U<<14)
#define IO_BANK0_GPIO39_CTRL_OEOVER_DISABLE                         (0x2U<<14)
#define IO_BANK0_GPIO39_CTRL_OEOVER_ENABLE                          (0x3U<<14)
#define IO_BANK0_GPIO39_CTRL_INOVER_NORMAL                          (0x0U<<16)
#define IO_BANK0_GPIO39_CTRL_INOVER_INVERT                          (0x1U<<16)
#define IO_BANK0_GPIO39_CTRL_INOVER_LOW                             (0x2U<<16)
#define IO_BANK0_GPIO39_CTRL_INOVER_HIGH                            (0x3U<<16)
#define IO_BANK0_GPIO39_CTRL_IRQOVER_NORMAL                         (0x0U<<28)
#define IO_BANK0_GPIO39_CTRL_IRQOVER_INVERT                         (0x1U<<28)
#define IO_BANK0_GPIO39_CTRL_IRQOVER_LOW                            (0x2U<<28)
#define IO_BANK0_GPIO39_CTRL_IRQOVER_HIGH                           (0x3U<<28)

// GPIO40_STATUS Configuration

