Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_io_bank0.h
#define IO_BANK0_GPIO40_STATUS_OUTTOPAD                             (0x1U<<9)
#define IO_BANK0_GPIO40_STATUS_OETOPAD                              (0x1U<<13)
#define IO_BANK0_GPIO40_STATUS_INFROMPAD                            (0x1U<<17)
#define IO_BANK0_GPIO40_STATUS_IRQTOPROC                            (0x1U<<26)

// GPIO40_CTRL Configuration

#define IO_BANK0_GPIO40_CTRL_FUNCSEL                                (0x1FU<<0)
#define IO_BANK0_GPIO40_CTRL_FUNCSEL_0                              (0x1U<<0)
#define IO_BANK0_GPIO40_CTRL_OUTOVER                                (0x3U<<12)
#define IO_BANK0_GPIO40_CTRL_OUTOVER_0                              (0x1U<<12)
#define IO_BANK0_GPIO40_CTRL_OEOVER                                 (0x3U<<14)
#define IO_BANK0_GPIO40_CTRL_OEOVER_0                               (0x1U<<14)
#define IO_BANK0_GPIO40_CTRL_INOVER                                 (0x3U<<16)
#define IO_BANK0_GPIO40_CTRL_INOVER_0                               (0x1U<<16)
#define IO_BANK0_GPIO40_CTRL_IRQOVER                                (0x3U<<28)
#define IO_BANK0_GPIO40_CTRL_IRQOVER_0                              (0x1U<<28)
#define IO_BANK0_GPIO40_CTRL_FUNCSEL_SPI1_RX                        (0x1U<<0)
#define IO_BANK0_GPIO40_CTRL_FUNCSEL_UART1_TX                       (0x2U<<0)
#define IO_BANK0_GPIO40_CTRL_FUNCSEL_I2C0_SDA                       (0x3U<<0)
#define IO_BANK0_GPIO40_CTRL_FUNCSEL_PWM_A_8                        (0x4U<<0)
#define IO_BANK0_GPIO40_CTRL_FUNCSEL_SIOB_PROC_40                   (0x5U<<0)
#define IO_BANK0_GPIO40_CTRL_FUNCSEL_PIO0_40                        (0x6U<<0)
#define IO_BANK0_GPIO40_CTRL_FUNCSEL_PIO1_40                        (0x7U<<0)
#define IO_BANK0_GPIO40_CTRL_FUNCSEL_PIO2_40                        (0x8U<<0)
#define IO_BANK0_GPIO40_CTRL_FUNCSEL_USB_MUXING_VBUS_DETECT         (0xAU<<0)
#define IO_BANK0_GPIO40_CTRL_FUNCSEL_NULL                           (0x1FU<<0)
#define IO_BANK0_GPIO40_CTRL_OUTOVER_NORMAL                         (0x0U<<12)
#define IO_BANK0_GPIO40_CTRL_OUTOVER_INVERT                         (0x1U<<12)
#define IO_BANK0_GPIO40_CTRL_OUTOVER_LOW                            (0x2U<<12)
#define IO_BANK0_GPIO40_CTRL_OUTOVER_HIGH                           (0x3U<<12)
#define IO_BANK0_GPIO40_CTRL_OEOVER_NORMAL                          (0x0U<<14)
#define IO_BANK0_GPIO40_CTRL_OEOVER_INVERT                          (0x1U<<14)
#define IO_BANK0_GPIO40_CTRL_OEOVER_DISABLE                         (0x2U<<14)
#define IO_BANK0_GPIO40_CTRL_OEOVER_ENABLE                          (0x3U<<14)
#define IO_BANK0_GPIO40_CTRL_INOVER_NORMAL                          (0x0U<<16)
#define IO_BANK0_GPIO40_CTRL_INOVER_INVERT                          (0x1U<<16)
#define IO_BANK0_GPIO40_CTRL_INOVER_LOW                             (0x2U<<16)
#define IO_BANK0_GPIO40_CTRL_INOVER_HIGH                            (0x3U<<16)
#define IO_BANK0_GPIO40_CTRL_IRQOVER_NORMAL                         (0x0U<<28)
#define IO_BANK0_GPIO40_CTRL_IRQOVER_INVERT                         (0x1U<<28)
#define IO_BANK0_GPIO40_CTRL_IRQOVER_LOW                            (0x2U<<28)
#define IO_BANK0_GPIO40_CTRL_IRQOVER_HIGH                           (0x3U<<28)

// GPIO41_STATUS Configuration

#define IO_BANK0_GPIO41_STATUS_OUTTOPAD                             (0x1U<<9)
#define IO_BANK0_GPIO41_STATUS_OETOPAD                              (0x1U<<13)
#define IO_BANK0_GPIO41_STATUS_INFROMPAD                            (0x1U<<17)
#define IO_BANK0_GPIO41_STATUS_IRQTOPROC                            (0x1U<<26)

// GPIO41_CTRL Configuration

#define IO_BANK0_GPIO41_CTRL_FUNCSEL                                (0x1FU<<0)
#define IO_BANK0_GPIO41_CTRL_FUNCSEL_0                              (0x1U<<0)
#define IO_BANK0_GPIO41_CTRL_OUTOVER                                (0x3U<<12)
#define IO_BANK0_GPIO41_CTRL_OUTOVER_0                              (0x1U<<12)
#define IO_BANK0_GPIO41_CTRL_OEOVER                                 (0x3U<<14)
#define IO_BANK0_GPIO41_CTRL_OEOVER_0                               (0x1U<<14)
#define IO_BANK0_GPIO41_CTRL_INOVER                                 (0x3U<<16)
#define IO_BANK0_GPIO41_CTRL_INOVER_0                               (0x1U<<16)
#define IO_BANK0_GPIO41_CTRL_IRQOVER                                (0x3U<<28)
#define IO_BANK0_GPIO41_CTRL_IRQOVER_0                              (0x1U<<28)
#define IO_BANK0_GPIO41_CTRL_FUNCSEL_SPI1_SS_N                      (0x1U<<0)
#define IO_BANK0_GPIO41_CTRL_FUNCSEL_UART1_RX                       (0x2U<<0)
#define IO_BANK0_GPIO41_CTRL_FUNCSEL_I2C0_SCL                       (0x3U<<0)
#define IO_BANK0_GPIO41_CTRL_FUNCSEL_PWM_B_8                        (0x4U<<0)
#define IO_BANK0_GPIO41_CTRL_FUNCSEL_SIOB_PROC_41                   (0x5U<<0)
#define IO_BANK0_GPIO41_CTRL_FUNCSEL_PIO0_41                        (0x6U<<0)
#define IO_BANK0_GPIO41_CTRL_FUNCSEL_PIO1_41                        (0x7U<<0)
#define IO_BANK0_GPIO41_CTRL_FUNCSEL_PIO2_41                        (0x8U<<0)
#define IO_BANK0_GPIO41_CTRL_FUNCSEL_USB_MUXING_VBUS_EN             (0xAU<<0)
#define IO_BANK0_GPIO41_CTRL_FUNCSEL_NULL                           (0x1FU<<0)
#define IO_BANK0_GPIO41_CTRL_OUTOVER_NORMAL                         (0x0U<<12)
#define IO_BANK0_GPIO41_CTRL_OUTOVER_INVERT                         (0x1U<<12)
#define IO_BANK0_GPIO41_CTRL_OUTOVER_LOW                            (0x2U<<12)
#define IO_BANK0_GPIO41_CTRL_OUTOVER_HIGH                           (0x3U<<12)
#define IO_BANK0_GPIO41_CTRL_OEOVER_NORMAL                          (0x0U<<14)
#define IO_BANK0_GPIO41_CTRL_OEOVER_INVERT                          (0x1U<<14)
#define IO_BANK0_GPIO41_CTRL_OEOVER_DISABLE                         (0x2U<<14)
#define IO_BANK0_GPIO41_CTRL_OEOVER_ENABLE                          (0x3U<<14)
#define IO_BANK0_GPIO41_CTRL_INOVER_NORMAL                          (0x0U<<16)
#define IO_BANK0_GPIO41_CTRL_INOVER_INVERT                          (0x1U<<16)
#define IO_BANK0_GPIO41_CTRL_INOVER_LOW                             (0x2U<<16)
#define IO_BANK0_GPIO41_CTRL_INOVER_HIGH                            (0x3U<<16)
#define IO_BANK0_GPIO41_CTRL_IRQOVER_NORMAL                         (0x0U<<28)
#define IO_BANK0_GPIO41_CTRL_IRQOVER_INVERT                         (0x1U<<28)
#define IO_BANK0_GPIO41_CTRL_IRQOVER_LOW                            (0x2U<<28)
#define IO_BANK0_GPIO41_CTRL_IRQOVER_HIGH                           (0x3U<<28)

// GPIO42_STATUS Configuration

