Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_io_bank0.h
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO0              (0x1U<<0)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO1              (0x1U<<1)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO2              (0x1U<<2)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO3              (0x1U<<3)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO4              (0x1U<<4)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO5              (0x1U<<5)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO6              (0x1U<<6)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO7              (0x1U<<7)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO8              (0x1U<<8)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO9              (0x1U<<9)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO10             (0x1U<<10)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO11             (0x1U<<11)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO12             (0x1U<<12)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO13             (0x1U<<13)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO14             (0x1U<<14)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO15             (0x1U<<15)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO16             (0x1U<<16)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO17             (0x1U<<17)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO18             (0x1U<<18)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO19             (0x1U<<19)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO20             (0x1U<<20)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO21             (0x1U<<21)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO22             (0x1U<<22)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO23             (0x1U<<23)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO24             (0x1U<<24)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO25             (0x1U<<25)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO26             (0x1U<<26)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO27             (0x1U<<27)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO28             (0x1U<<28)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO29             (0x1U<<29)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO30             (0x1U<<30)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE0_GPIO31             (0x1U<<31)

// IRQSUMMARY_DORMANT_WAKE_SECURE1 Configuration

#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE1_GPIO32             (0x1U<<0)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE1_GPIO33             (0x1U<<1)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE1_GPIO34             (0x1U<<2)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE1_GPIO35             (0x1U<<3)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE1_GPIO36             (0x1U<<4)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE1_GPIO37             (0x1U<<5)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE1_GPIO38             (0x1U<<6)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE1_GPIO39             (0x1U<<7)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE1_GPIO40             (0x1U<<8)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE1_GPIO41             (0x1U<<9)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE1_GPIO42             (0x1U<<10)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE1_GPIO43             (0x1U<<11)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE1_GPIO44             (0x1U<<12)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE1_GPIO45             (0x1U<<13)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE1_GPIO46             (0x1U<<14)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_SECURE1_GPIO47             (0x1U<<15)

// IRQSUMMARY_DORMANT_WAKE_NONSECURE0 Configuration

#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO0           (0x1U<<0)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO1           (0x1U<<1)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO2           (0x1U<<2)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO3           (0x1U<<3)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO4           (0x1U<<4)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO5           (0x1U<<5)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO6           (0x1U<<6)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO7           (0x1U<<7)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO8           (0x1U<<8)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO9           (0x1U<<9)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO10          (0x1U<<10)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO11          (0x1U<<11)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO12          (0x1U<<12)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO13          (0x1U<<13)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO14          (0x1U<<14)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO15          (0x1U<<15)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO16          (0x1U<<16)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO17          (0x1U<<17)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO18          (0x1U<<18)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO19          (0x1U<<19)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO20          (0x1U<<20)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO21          (0x1U<<21)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO22          (0x1U<<22)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO23          (0x1U<<23)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO24          (0x1U<<24)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO25          (0x1U<<25)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO26          (0x1U<<26)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO27          (0x1U<<27)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO28          (0x1U<<28)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO29          (0x1U<<29)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO30          (0x1U<<30)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO31          (0x1U<<31)

// IRQSUMMARY_DORMANT_WAKE_NONSECURE1 Configuration

#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO32          (0x1U<<0)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO33          (0x1U<<1)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO34          (0x1U<<2)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO35          (0x1U<<3)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO36          (0x1U<<4)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO37          (0x1U<<5)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO38          (0x1U<<6)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO39          (0x1U<<7)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO40          (0x1U<<8)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO41          (0x1U<<9)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO42          (0x1U<<10)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO43          (0x1U<<11)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO44          (0x1U<<12)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO45          (0x1U<<13)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO46          (0x1U<<14)
#define IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO47          (0x1U<<15)

// INTR0 Configuration

