Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_io_bank0.h
// PROC0_INTE4 Configuration

#define IO_BANK0_PROC0_INTE4_GPIO32_LEVEL_LOW                       (0x1U<<0)
#define IO_BANK0_PROC0_INTE4_GPIO32_LEVEL_HIGH                      (0x1U<<1)
#define IO_BANK0_PROC0_INTE4_GPIO32_EDGE_LOW                        (0x1U<<2)
#define IO_BANK0_PROC0_INTE4_GPIO32_EDGE_HIGH                       (0x1U<<3)
#define IO_BANK0_PROC0_INTE4_GPIO33_LEVEL_LOW                       (0x1U<<4)
#define IO_BANK0_PROC0_INTE4_GPIO33_LEVEL_HIGH                      (0x1U<<5)
#define IO_BANK0_PROC0_INTE4_GPIO33_EDGE_LOW                        (0x1U<<6)
#define IO_BANK0_PROC0_INTE4_GPIO33_EDGE_HIGH                       (0x1U<<7)
#define IO_BANK0_PROC0_INTE4_GPIO34_LEVEL_LOW                       (0x1U<<8)
#define IO_BANK0_PROC0_INTE4_GPIO34_LEVEL_HIGH                      (0x1U<<9)
#define IO_BANK0_PROC0_INTE4_GPIO34_EDGE_LOW                        (0x1U<<10)
#define IO_BANK0_PROC0_INTE4_GPIO34_EDGE_HIGH                       (0x1U<<11)
#define IO_BANK0_PROC0_INTE4_GPIO35_LEVEL_LOW                       (0x1U<<12)
#define IO_BANK0_PROC0_INTE4_GPIO35_LEVEL_HIGH                      (0x1U<<13)
#define IO_BANK0_PROC0_INTE4_GPIO35_EDGE_LOW                        (0x1U<<14)
#define IO_BANK0_PROC0_INTE4_GPIO35_EDGE_HIGH                       (0x1U<<15)
#define IO_BANK0_PROC0_INTE4_GPIO36_LEVEL_LOW                       (0x1U<<16)
#define IO_BANK0_PROC0_INTE4_GPIO36_LEVEL_HIGH                      (0x1U<<17)
#define IO_BANK0_PROC0_INTE4_GPIO36_EDGE_LOW                        (0x1U<<18)
#define IO_BANK0_PROC0_INTE4_GPIO36_EDGE_HIGH                       (0x1U<<19)
#define IO_BANK0_PROC0_INTE4_GPIO37_LEVEL_LOW                       (0x1U<<20)
#define IO_BANK0_PROC0_INTE4_GPIO37_LEVEL_HIGH                      (0x1U<<21)
#define IO_BANK0_PROC0_INTE4_GPIO37_EDGE_LOW                        (0x1U<<22)
#define IO_BANK0_PROC0_INTE4_GPIO37_EDGE_HIGH                       (0x1U<<23)
#define IO_BANK0_PROC0_INTE4_GPIO38_LEVEL_LOW                       (0x1U<<24)
#define IO_BANK0_PROC0_INTE4_GPIO38_LEVEL_HIGH                      (0x1U<<25)
#define IO_BANK0_PROC0_INTE4_GPIO38_EDGE_LOW                        (0x1U<<26)
#define IO_BANK0_PROC0_INTE4_GPIO38_EDGE_HIGH                       (0x1U<<27)
#define IO_BANK0_PROC0_INTE4_GPIO39_LEVEL_LOW                       (0x1U<<28)
#define IO_BANK0_PROC0_INTE4_GPIO39_LEVEL_HIGH                      (0x1U<<29)
#define IO_BANK0_PROC0_INTE4_GPIO39_EDGE_LOW                        (0x1U<<30)
#define IO_BANK0_PROC0_INTE4_GPIO39_EDGE_HIGH                       (0x1U<<31)

// PROC0_INTE5 Configuration

#define IO_BANK0_PROC0_INTE5_GPIO40_LEVEL_LOW                       (0x1U<<0)
#define IO_BANK0_PROC0_INTE5_GPIO40_LEVEL_HIGH                      (0x1U<<1)
#define IO_BANK0_PROC0_INTE5_GPIO40_EDGE_LOW                        (0x1U<<2)
#define IO_BANK0_PROC0_INTE5_GPIO40_EDGE_HIGH                       (0x1U<<3)
#define IO_BANK0_PROC0_INTE5_GPIO41_LEVEL_LOW                       (0x1U<<4)
#define IO_BANK0_PROC0_INTE5_GPIO41_LEVEL_HIGH                      (0x1U<<5)
#define IO_BANK0_PROC0_INTE5_GPIO41_EDGE_LOW                        (0x1U<<6)
#define IO_BANK0_PROC0_INTE5_GPIO41_EDGE_HIGH                       (0x1U<<7)
#define IO_BANK0_PROC0_INTE5_GPIO42_LEVEL_LOW                       (0x1U<<8)
#define IO_BANK0_PROC0_INTE5_GPIO42_LEVEL_HIGH                      (0x1U<<9)
#define IO_BANK0_PROC0_INTE5_GPIO42_EDGE_LOW                        (0x1U<<10)
#define IO_BANK0_PROC0_INTE5_GPIO42_EDGE_HIGH                       (0x1U<<11)
#define IO_BANK0_PROC0_INTE5_GPIO43_LEVEL_LOW                       (0x1U<<12)
#define IO_BANK0_PROC0_INTE5_GPIO43_LEVEL_HIGH                      (0x1U<<13)
#define IO_BANK0_PROC0_INTE5_GPIO43_EDGE_LOW                        (0x1U<<14)
#define IO_BANK0_PROC0_INTE5_GPIO43_EDGE_HIGH                       (0x1U<<15)
#define IO_BANK0_PROC0_INTE5_GPIO44_LEVEL_LOW                       (0x1U<<16)
#define IO_BANK0_PROC0_INTE5_GPIO44_LEVEL_HIGH                      (0x1U<<17)
#define IO_BANK0_PROC0_INTE5_GPIO44_EDGE_LOW                        (0x1U<<18)
#define IO_BANK0_PROC0_INTE5_GPIO44_EDGE_HIGH                       (0x1U<<19)
#define IO_BANK0_PROC0_INTE5_GPIO45_LEVEL_LOW                       (0x1U<<20)
#define IO_BANK0_PROC0_INTE5_GPIO45_LEVEL_HIGH                      (0x1U<<21)
#define IO_BANK0_PROC0_INTE5_GPIO45_EDGE_LOW                        (0x1U<<22)
#define IO_BANK0_PROC0_INTE5_GPIO45_EDGE_HIGH                       (0x1U<<23)
#define IO_BANK0_PROC0_INTE5_GPIO46_LEVEL_LOW                       (0x1U<<24)
#define IO_BANK0_PROC0_INTE5_GPIO46_LEVEL_HIGH                      (0x1U<<25)
#define IO_BANK0_PROC0_INTE5_GPIO46_EDGE_LOW                        (0x1U<<26)
#define IO_BANK0_PROC0_INTE5_GPIO46_EDGE_HIGH                       (0x1U<<27)
#define IO_BANK0_PROC0_INTE5_GPIO47_LEVEL_LOW                       (0x1U<<28)
#define IO_BANK0_PROC0_INTE5_GPIO47_LEVEL_HIGH                      (0x1U<<29)
#define IO_BANK0_PROC0_INTE5_GPIO47_EDGE_LOW                        (0x1U<<30)
#define IO_BANK0_PROC0_INTE5_GPIO47_EDGE_HIGH                       (0x1U<<31)

// PROC0_INTF0 Configuration

#define IO_BANK0_PROC0_INTF0_GPIO0_LEVEL_LOW                        (0x1U<<0)
#define IO_BANK0_PROC0_INTF0_GPIO0_LEVEL_HIGH                       (0x1U<<1)
#define IO_BANK0_PROC0_INTF0_GPIO0_EDGE_LOW                         (0x1U<<2)
#define IO_BANK0_PROC0_INTF0_GPIO0_EDGE_HIGH                        (0x1U<<3)
#define IO_BANK0_PROC0_INTF0_GPIO1_LEVEL_LOW                        (0x1U<<4)
#define IO_BANK0_PROC0_INTF0_GPIO1_LEVEL_HIGH                       (0x1U<<5)
#define IO_BANK0_PROC0_INTF0_GPIO1_EDGE_LOW                         (0x1U<<6)
#define IO_BANK0_PROC0_INTF0_GPIO1_EDGE_HIGH                        (0x1U<<7)
#define IO_BANK0_PROC0_INTF0_GPIO2_LEVEL_LOW                        (0x1U<<8)
#define IO_BANK0_PROC0_INTF0_GPIO2_LEVEL_HIGH                       (0x1U<<9)
#define IO_BANK0_PROC0_INTF0_GPIO2_EDGE_LOW                         (0x1U<<10)
#define IO_BANK0_PROC0_INTF0_GPIO2_EDGE_HIGH                        (0x1U<<11)
#define IO_BANK0_PROC0_INTF0_GPIO3_LEVEL_LOW                        (0x1U<<12)
#define IO_BANK0_PROC0_INTF0_GPIO3_LEVEL_HIGH                       (0x1U<<13)
#define IO_BANK0_PROC0_INTF0_GPIO3_EDGE_LOW                         (0x1U<<14)
#define IO_BANK0_PROC0_INTF0_GPIO3_EDGE_HIGH                        (0x1U<<15)
#define IO_BANK0_PROC0_INTF0_GPIO4_LEVEL_LOW                        (0x1U<<16)
#define IO_BANK0_PROC0_INTF0_GPIO4_LEVEL_HIGH                       (0x1U<<17)
#define IO_BANK0_PROC0_INTF0_GPIO4_EDGE_LOW                         (0x1U<<18)
#define IO_BANK0_PROC0_INTF0_GPIO4_EDGE_HIGH                        (0x1U<<19)
#define IO_BANK0_PROC0_INTF0_GPIO5_LEVEL_LOW                        (0x1U<<20)
#define IO_BANK0_PROC0_INTF0_GPIO5_LEVEL_HIGH                       (0x1U<<21)
#define IO_BANK0_PROC0_INTF0_GPIO5_EDGE_LOW                         (0x1U<<22)
#define IO_BANK0_PROC0_INTF0_GPIO5_EDGE_HIGH                        (0x1U<<23)
#define IO_BANK0_PROC0_INTF0_GPIO6_LEVEL_LOW                        (0x1U<<24)
#define IO_BANK0_PROC0_INTF0_GPIO6_LEVEL_HIGH                       (0x1U<<25)
#define IO_BANK0_PROC0_INTF0_GPIO6_EDGE_LOW                         (0x1U<<26)
#define IO_BANK0_PROC0_INTF0_GPIO6_EDGE_HIGH                        (0x1U<<27)
#define IO_BANK0_PROC0_INTF0_GPIO7_LEVEL_LOW                        (0x1U<<28)
#define IO_BANK0_PROC0_INTF0_GPIO7_LEVEL_HIGH                       (0x1U<<29)
#define IO_BANK0_PROC0_INTF0_GPIO7_EDGE_LOW                         (0x1U<<30)
#define IO_BANK0_PROC0_INTF0_GPIO7_EDGE_HIGH                        (0x1U<<31)

// PROC0_INTF1 Configuration

#define IO_BANK0_PROC0_INTF1_GPIO8_LEVEL_LOW                        (0x1U<<0)
#define IO_BANK0_PROC0_INTF1_GPIO8_LEVEL_HIGH                       (0x1U<<1)
#define IO_BANK0_PROC0_INTF1_GPIO8_EDGE_LOW                         (0x1U<<2)
#define IO_BANK0_PROC0_INTF1_GPIO8_EDGE_HIGH                        (0x1U<<3)
#define IO_BANK0_PROC0_INTF1_GPIO9_LEVEL_LOW                        (0x1U<<4)
#define IO_BANK0_PROC0_INTF1_GPIO9_LEVEL_HIGH                       (0x1U<<5)
#define IO_BANK0_PROC0_INTF1_GPIO9_EDGE_LOW                         (0x1U<<6)
#define IO_BANK0_PROC0_INTF1_GPIO9_EDGE_HIGH                        (0x1U<<7)
#define IO_BANK0_PROC0_INTF1_GPIO10_LEVEL_LOW                       (0x1U<<8)
#define IO_BANK0_PROC0_INTF1_GPIO10_LEVEL_HIGH                      (0x1U<<9)
#define IO_BANK0_PROC0_INTF1_GPIO10_EDGE_LOW                        (0x1U<<10)
#define IO_BANK0_PROC0_INTF1_GPIO10_EDGE_HIGH                       (0x1U<<11)
#define IO_BANK0_PROC0_INTF1_GPIO11_LEVEL_LOW                       (0x1U<<12)
#define IO_BANK0_PROC0_INTF1_GPIO11_LEVEL_HIGH                      (0x1U<<13)
#define IO_BANK0_PROC0_INTF1_GPIO11_EDGE_LOW                        (0x1U<<14)
#define IO_BANK0_PROC0_INTF1_GPIO11_EDGE_HIGH                       (0x1U<<15)
#define IO_BANK0_PROC0_INTF1_GPIO12_LEVEL_LOW                       (0x1U<<16)
#define IO_BANK0_PROC0_INTF1_GPIO12_LEVEL_HIGH                      (0x1U<<17)
#define IO_BANK0_PROC0_INTF1_GPIO12_EDGE_LOW                        (0x1U<<18)
#define IO_BANK0_PROC0_INTF1_GPIO12_EDGE_HIGH                       (0x1U<<19)
#define IO_BANK0_PROC0_INTF1_GPIO13_LEVEL_LOW                       (0x1U<<20)
#define IO_BANK0_PROC0_INTF1_GPIO13_LEVEL_HIGH                      (0x1U<<21)
#define IO_BANK0_PROC0_INTF1_GPIO13_EDGE_LOW                        (0x1U<<22)
#define IO_BANK0_PROC0_INTF1_GPIO13_EDGE_HIGH                       (0x1U<<23)
#define IO_BANK0_PROC0_INTF1_GPIO14_LEVEL_LOW                       (0x1U<<24)
#define IO_BANK0_PROC0_INTF1_GPIO14_LEVEL_HIGH                      (0x1U<<25)
#define IO_BANK0_PROC0_INTF1_GPIO14_EDGE_LOW                        (0x1U<<26)
#define IO_BANK0_PROC0_INTF1_GPIO14_EDGE_HIGH                       (0x1U<<27)
#define IO_BANK0_PROC0_INTF1_GPIO15_LEVEL_LOW                       (0x1U<<28)
#define IO_BANK0_PROC0_INTF1_GPIO15_LEVEL_HIGH                      (0x1U<<29)
#define IO_BANK0_PROC0_INTF1_GPIO15_EDGE_LOW                        (0x1U<<30)
#define IO_BANK0_PROC0_INTF1_GPIO15_EDGE_HIGH                       (0x1U<<31)

