Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_io_bank0.h
// PROC0_INTS2 Configuration

#define IO_BANK0_PROC0_INTS2_GPIO16_LEVEL_LOW                       (0x1U<<0)
#define IO_BANK0_PROC0_INTS2_GPIO16_LEVEL_HIGH                      (0x1U<<1)
#define IO_BANK0_PROC0_INTS2_GPIO16_EDGE_LOW                        (0x1U<<2)
#define IO_BANK0_PROC0_INTS2_GPIO16_EDGE_HIGH                       (0x1U<<3)
#define IO_BANK0_PROC0_INTS2_GPIO17_LEVEL_LOW                       (0x1U<<4)
#define IO_BANK0_PROC0_INTS2_GPIO17_LEVEL_HIGH                      (0x1U<<5)
#define IO_BANK0_PROC0_INTS2_GPIO17_EDGE_LOW                        (0x1U<<6)
#define IO_BANK0_PROC0_INTS2_GPIO17_EDGE_HIGH                       (0x1U<<7)
#define IO_BANK0_PROC0_INTS2_GPIO18_LEVEL_LOW                       (0x1U<<8)
#define IO_BANK0_PROC0_INTS2_GPIO18_LEVEL_HIGH                      (0x1U<<9)
#define IO_BANK0_PROC0_INTS2_GPIO18_EDGE_LOW                        (0x1U<<10)
#define IO_BANK0_PROC0_INTS2_GPIO18_EDGE_HIGH                       (0x1U<<11)
#define IO_BANK0_PROC0_INTS2_GPIO19_LEVEL_LOW                       (0x1U<<12)
#define IO_BANK0_PROC0_INTS2_GPIO19_LEVEL_HIGH                      (0x1U<<13)
#define IO_BANK0_PROC0_INTS2_GPIO19_EDGE_LOW                        (0x1U<<14)
#define IO_BANK0_PROC0_INTS2_GPIO19_EDGE_HIGH                       (0x1U<<15)
#define IO_BANK0_PROC0_INTS2_GPIO20_LEVEL_LOW                       (0x1U<<16)
#define IO_BANK0_PROC0_INTS2_GPIO20_LEVEL_HIGH                      (0x1U<<17)
#define IO_BANK0_PROC0_INTS2_GPIO20_EDGE_LOW                        (0x1U<<18)
#define IO_BANK0_PROC0_INTS2_GPIO20_EDGE_HIGH                       (0x1U<<19)
#define IO_BANK0_PROC0_INTS2_GPIO21_LEVEL_LOW                       (0x1U<<20)
#define IO_BANK0_PROC0_INTS2_GPIO21_LEVEL_HIGH                      (0x1U<<21)
#define IO_BANK0_PROC0_INTS2_GPIO21_EDGE_LOW                        (0x1U<<22)
#define IO_BANK0_PROC0_INTS2_GPIO21_EDGE_HIGH                       (0x1U<<23)
#define IO_BANK0_PROC0_INTS2_GPIO22_LEVEL_LOW                       (0x1U<<24)
#define IO_BANK0_PROC0_INTS2_GPIO22_LEVEL_HIGH                      (0x1U<<25)
#define IO_BANK0_PROC0_INTS2_GPIO22_EDGE_LOW                        (0x1U<<26)
#define IO_BANK0_PROC0_INTS2_GPIO22_EDGE_HIGH                       (0x1U<<27)
#define IO_BANK0_PROC0_INTS2_GPIO23_LEVEL_LOW                       (0x1U<<28)
#define IO_BANK0_PROC0_INTS2_GPIO23_LEVEL_HIGH                      (0x1U<<29)
#define IO_BANK0_PROC0_INTS2_GPIO23_EDGE_LOW                        (0x1U<<30)
#define IO_BANK0_PROC0_INTS2_GPIO23_EDGE_HIGH                       (0x1U<<31)

// PROC0_INTS3 Configuration

#define IO_BANK0_PROC0_INTS3_GPIO24_LEVEL_LOW                       (0x1U<<0)
#define IO_BANK0_PROC0_INTS3_GPIO24_LEVEL_HIGH                      (0x1U<<1)
#define IO_BANK0_PROC0_INTS3_GPIO24_EDGE_LOW                        (0x1U<<2)
#define IO_BANK0_PROC0_INTS3_GPIO24_EDGE_HIGH                       (0x1U<<3)
#define IO_BANK0_PROC0_INTS3_GPIO25_LEVEL_LOW                       (0x1U<<4)
#define IO_BANK0_PROC0_INTS3_GPIO25_LEVEL_HIGH                      (0x1U<<5)
#define IO_BANK0_PROC0_INTS3_GPIO25_EDGE_LOW                        (0x1U<<6)
#define IO_BANK0_PROC0_INTS3_GPIO25_EDGE_HIGH                       (0x1U<<7)
#define IO_BANK0_PROC0_INTS3_GPIO26_LEVEL_LOW                       (0x1U<<8)
#define IO_BANK0_PROC0_INTS3_GPIO26_LEVEL_HIGH                      (0x1U<<9)
#define IO_BANK0_PROC0_INTS3_GPIO26_EDGE_LOW                        (0x1U<<10)
#define IO_BANK0_PROC0_INTS3_GPIO26_EDGE_HIGH                       (0x1U<<11)
#define IO_BANK0_PROC0_INTS3_GPIO27_LEVEL_LOW                       (0x1U<<12)
#define IO_BANK0_PROC0_INTS3_GPIO27_LEVEL_HIGH                      (0x1U<<13)
#define IO_BANK0_PROC0_INTS3_GPIO27_EDGE_LOW                        (0x1U<<14)
#define IO_BANK0_PROC0_INTS3_GPIO27_EDGE_HIGH                       (0x1U<<15)
#define IO_BANK0_PROC0_INTS3_GPIO28_LEVEL_LOW                       (0x1U<<16)
#define IO_BANK0_PROC0_INTS3_GPIO28_LEVEL_HIGH                      (0x1U<<17)
#define IO_BANK0_PROC0_INTS3_GPIO28_EDGE_LOW                        (0x1U<<18)
#define IO_BANK0_PROC0_INTS3_GPIO28_EDGE_HIGH                       (0x1U<<19)
#define IO_BANK0_PROC0_INTS3_GPIO29_LEVEL_LOW                       (0x1U<<20)
#define IO_BANK0_PROC0_INTS3_GPIO29_LEVEL_HIGH                      (0x1U<<21)
#define IO_BANK0_PROC0_INTS3_GPIO29_EDGE_LOW                        (0x1U<<22)
#define IO_BANK0_PROC0_INTS3_GPIO29_EDGE_HIGH                       (0x1U<<23)
#define IO_BANK0_PROC0_INTS3_GPIO30_LEVEL_LOW                       (0x1U<<24)
#define IO_BANK0_PROC0_INTS3_GPIO30_LEVEL_HIGH                      (0x1U<<25)
#define IO_BANK0_PROC0_INTS3_GPIO30_EDGE_LOW                        (0x1U<<26)
#define IO_BANK0_PROC0_INTS3_GPIO30_EDGE_HIGH                       (0x1U<<27)
#define IO_BANK0_PROC0_INTS3_GPIO31_LEVEL_LOW                       (0x1U<<28)
#define IO_BANK0_PROC0_INTS3_GPIO31_LEVEL_HIGH                      (0x1U<<29)
#define IO_BANK0_PROC0_INTS3_GPIO31_EDGE_LOW                        (0x1U<<30)
#define IO_BANK0_PROC0_INTS3_GPIO31_EDGE_HIGH                       (0x1U<<31)

// PROC0_INTS4 Configuration

#define IO_BANK0_PROC0_INTS4_GPIO32_LEVEL_LOW                       (0x1U<<0)
#define IO_BANK0_PROC0_INTS4_GPIO32_LEVEL_HIGH                      (0x1U<<1)
#define IO_BANK0_PROC0_INTS4_GPIO32_EDGE_LOW                        (0x1U<<2)
#define IO_BANK0_PROC0_INTS4_GPIO32_EDGE_HIGH                       (0x1U<<3)
#define IO_BANK0_PROC0_INTS4_GPIO33_LEVEL_LOW                       (0x1U<<4)
#define IO_BANK0_PROC0_INTS4_GPIO33_LEVEL_HIGH                      (0x1U<<5)
#define IO_BANK0_PROC0_INTS4_GPIO33_EDGE_LOW                        (0x1U<<6)
#define IO_BANK0_PROC0_INTS4_GPIO33_EDGE_HIGH                       (0x1U<<7)
#define IO_BANK0_PROC0_INTS4_GPIO34_LEVEL_LOW                       (0x1U<<8)
#define IO_BANK0_PROC0_INTS4_GPIO34_LEVEL_HIGH                      (0x1U<<9)
#define IO_BANK0_PROC0_INTS4_GPIO34_EDGE_LOW                        (0x1U<<10)
#define IO_BANK0_PROC0_INTS4_GPIO34_EDGE_HIGH                       (0x1U<<11)
#define IO_BANK0_PROC0_INTS4_GPIO35_LEVEL_LOW                       (0x1U<<12)
#define IO_BANK0_PROC0_INTS4_GPIO35_LEVEL_HIGH                      (0x1U<<13)
#define IO_BANK0_PROC0_INTS4_GPIO35_EDGE_LOW                        (0x1U<<14)
#define IO_BANK0_PROC0_INTS4_GPIO35_EDGE_HIGH                       (0x1U<<15)
#define IO_BANK0_PROC0_INTS4_GPIO36_LEVEL_LOW                       (0x1U<<16)
#define IO_BANK0_PROC0_INTS4_GPIO36_LEVEL_HIGH                      (0x1U<<17)
#define IO_BANK0_PROC0_INTS4_GPIO36_EDGE_LOW                        (0x1U<<18)
#define IO_BANK0_PROC0_INTS4_GPIO36_EDGE_HIGH                       (0x1U<<19)
#define IO_BANK0_PROC0_INTS4_GPIO37_LEVEL_LOW                       (0x1U<<20)
#define IO_BANK0_PROC0_INTS4_GPIO37_LEVEL_HIGH                      (0x1U<<21)
#define IO_BANK0_PROC0_INTS4_GPIO37_EDGE_LOW                        (0x1U<<22)
#define IO_BANK0_PROC0_INTS4_GPIO37_EDGE_HIGH                       (0x1U<<23)
#define IO_BANK0_PROC0_INTS4_GPIO38_LEVEL_LOW                       (0x1U<<24)
#define IO_BANK0_PROC0_INTS4_GPIO38_LEVEL_HIGH                      (0x1U<<25)
#define IO_BANK0_PROC0_INTS4_GPIO38_EDGE_LOW                        (0x1U<<26)
#define IO_BANK0_PROC0_INTS4_GPIO38_EDGE_HIGH                       (0x1U<<27)
#define IO_BANK0_PROC0_INTS4_GPIO39_LEVEL_LOW                       (0x1U<<28)
#define IO_BANK0_PROC0_INTS4_GPIO39_LEVEL_HIGH                      (0x1U<<29)
#define IO_BANK0_PROC0_INTS4_GPIO39_EDGE_LOW                        (0x1U<<30)
#define IO_BANK0_PROC0_INTS4_GPIO39_EDGE_HIGH                       (0x1U<<31)

// PROC0_INTS5 Configuration

#define IO_BANK0_PROC0_INTS5_GPIO40_LEVEL_LOW                       (0x1U<<0)
#define IO_BANK0_PROC0_INTS5_GPIO40_LEVEL_HIGH                      (0x1U<<1)
#define IO_BANK0_PROC0_INTS5_GPIO40_EDGE_LOW                        (0x1U<<2)
#define IO_BANK0_PROC0_INTS5_GPIO40_EDGE_HIGH                       (0x1U<<3)
#define IO_BANK0_PROC0_INTS5_GPIO41_LEVEL_LOW                       (0x1U<<4)
#define IO_BANK0_PROC0_INTS5_GPIO41_LEVEL_HIGH                      (0x1U<<5)
#define IO_BANK0_PROC0_INTS5_GPIO41_EDGE_LOW                        (0x1U<<6)
#define IO_BANK0_PROC0_INTS5_GPIO41_EDGE_HIGH                       (0x1U<<7)
#define IO_BANK0_PROC0_INTS5_GPIO42_LEVEL_LOW                       (0x1U<<8)
#define IO_BANK0_PROC0_INTS5_GPIO42_LEVEL_HIGH                      (0x1U<<9)
#define IO_BANK0_PROC0_INTS5_GPIO42_EDGE_LOW                        (0x1U<<10)
#define IO_BANK0_PROC0_INTS5_GPIO42_EDGE_HIGH                       (0x1U<<11)
#define IO_BANK0_PROC0_INTS5_GPIO43_LEVEL_LOW                       (0x1U<<12)
#define IO_BANK0_PROC0_INTS5_GPIO43_LEVEL_HIGH                      (0x1U<<13)
#define IO_BANK0_PROC0_INTS5_GPIO43_EDGE_LOW                        (0x1U<<14)
#define IO_BANK0_PROC0_INTS5_GPIO43_EDGE_HIGH                       (0x1U<<15)
#define IO_BANK0_PROC0_INTS5_GPIO44_LEVEL_LOW                       (0x1U<<16)
#define IO_BANK0_PROC0_INTS5_GPIO44_LEVEL_HIGH                      (0x1U<<17)
#define IO_BANK0_PROC0_INTS5_GPIO44_EDGE_LOW                        (0x1U<<18)
#define IO_BANK0_PROC0_INTS5_GPIO44_EDGE_HIGH                       (0x1U<<19)
#define IO_BANK0_PROC0_INTS5_GPIO45_LEVEL_LOW                       (0x1U<<20)
#define IO_BANK0_PROC0_INTS5_GPIO45_LEVEL_HIGH                      (0x1U<<21)
#define IO_BANK0_PROC0_INTS5_GPIO45_EDGE_LOW                        (0x1U<<22)
#define IO_BANK0_PROC0_INTS5_GPIO45_EDGE_HIGH                       (0x1U<<23)
#define IO_BANK0_PROC0_INTS5_GPIO46_LEVEL_LOW                       (0x1U<<24)
#define IO_BANK0_PROC0_INTS5_GPIO46_LEVEL_HIGH                      (0x1U<<25)
#define IO_BANK0_PROC0_INTS5_GPIO46_EDGE_LOW                        (0x1U<<26)
#define IO_BANK0_PROC0_INTS5_GPIO46_EDGE_HIGH                       (0x1U<<27)
#define IO_BANK0_PROC0_INTS5_GPIO47_LEVEL_LOW                       (0x1U<<28)
#define IO_BANK0_PROC0_INTS5_GPIO47_LEVEL_HIGH                      (0x1U<<29)
#define IO_BANK0_PROC0_INTS5_GPIO47_EDGE_LOW                        (0x1U<<30)
#define IO_BANK0_PROC0_INTS5_GPIO47_EDGE_HIGH                       (0x1U<<31)

// PROC1_INTE0 Configuration

