Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_io_bank0.h
#define IO_BANK0_PROC1_INTE0_GPIO0_LEVEL_LOW                        (0x1U<<0)
#define IO_BANK0_PROC1_INTE0_GPIO0_LEVEL_HIGH                       (0x1U<<1)
#define IO_BANK0_PROC1_INTE0_GPIO0_EDGE_LOW                         (0x1U<<2)
#define IO_BANK0_PROC1_INTE0_GPIO0_EDGE_HIGH                        (0x1U<<3)
#define IO_BANK0_PROC1_INTE0_GPIO1_LEVEL_LOW                        (0x1U<<4)
#define IO_BANK0_PROC1_INTE0_GPIO1_LEVEL_HIGH                       (0x1U<<5)
#define IO_BANK0_PROC1_INTE0_GPIO1_EDGE_LOW                         (0x1U<<6)
#define IO_BANK0_PROC1_INTE0_GPIO1_EDGE_HIGH                        (0x1U<<7)
#define IO_BANK0_PROC1_INTE0_GPIO2_LEVEL_LOW                        (0x1U<<8)
#define IO_BANK0_PROC1_INTE0_GPIO2_LEVEL_HIGH                       (0x1U<<9)
#define IO_BANK0_PROC1_INTE0_GPIO2_EDGE_LOW                         (0x1U<<10)
#define IO_BANK0_PROC1_INTE0_GPIO2_EDGE_HIGH                        (0x1U<<11)
#define IO_BANK0_PROC1_INTE0_GPIO3_LEVEL_LOW                        (0x1U<<12)
#define IO_BANK0_PROC1_INTE0_GPIO3_LEVEL_HIGH                       (0x1U<<13)
#define IO_BANK0_PROC1_INTE0_GPIO3_EDGE_LOW                         (0x1U<<14)
#define IO_BANK0_PROC1_INTE0_GPIO3_EDGE_HIGH                        (0x1U<<15)
#define IO_BANK0_PROC1_INTE0_GPIO4_LEVEL_LOW                        (0x1U<<16)
#define IO_BANK0_PROC1_INTE0_GPIO4_LEVEL_HIGH                       (0x1U<<17)
#define IO_BANK0_PROC1_INTE0_GPIO4_EDGE_LOW                         (0x1U<<18)
#define IO_BANK0_PROC1_INTE0_GPIO4_EDGE_HIGH                        (0x1U<<19)
#define IO_BANK0_PROC1_INTE0_GPIO5_LEVEL_LOW                        (0x1U<<20)
#define IO_BANK0_PROC1_INTE0_GPIO5_LEVEL_HIGH                       (0x1U<<21)
#define IO_BANK0_PROC1_INTE0_GPIO5_EDGE_LOW                         (0x1U<<22)
#define IO_BANK0_PROC1_INTE0_GPIO5_EDGE_HIGH                        (0x1U<<23)
#define IO_BANK0_PROC1_INTE0_GPIO6_LEVEL_LOW                        (0x1U<<24)
#define IO_BANK0_PROC1_INTE0_GPIO6_LEVEL_HIGH                       (0x1U<<25)
#define IO_BANK0_PROC1_INTE0_GPIO6_EDGE_LOW                         (0x1U<<26)
#define IO_BANK0_PROC1_INTE0_GPIO6_EDGE_HIGH                        (0x1U<<27)
#define IO_BANK0_PROC1_INTE0_GPIO7_LEVEL_LOW                        (0x1U<<28)
#define IO_BANK0_PROC1_INTE0_GPIO7_LEVEL_HIGH                       (0x1U<<29)
#define IO_BANK0_PROC1_INTE0_GPIO7_EDGE_LOW                         (0x1U<<30)
#define IO_BANK0_PROC1_INTE0_GPIO7_EDGE_HIGH                        (0x1U<<31)

// PROC1_INTE1 Configuration

#define IO_BANK0_PROC1_INTE1_GPIO8_LEVEL_LOW                        (0x1U<<0)
#define IO_BANK0_PROC1_INTE1_GPIO8_LEVEL_HIGH                       (0x1U<<1)
#define IO_BANK0_PROC1_INTE1_GPIO8_EDGE_LOW                         (0x1U<<2)
#define IO_BANK0_PROC1_INTE1_GPIO8_EDGE_HIGH                        (0x1U<<3)
#define IO_BANK0_PROC1_INTE1_GPIO9_LEVEL_LOW                        (0x1U<<4)
#define IO_BANK0_PROC1_INTE1_GPIO9_LEVEL_HIGH                       (0x1U<<5)
#define IO_BANK0_PROC1_INTE1_GPIO9_EDGE_LOW                         (0x1U<<6)
#define IO_BANK0_PROC1_INTE1_GPIO9_EDGE_HIGH                        (0x1U<<7)
#define IO_BANK0_PROC1_INTE1_GPIO10_LEVEL_LOW                       (0x1U<<8)
#define IO_BANK0_PROC1_INTE1_GPIO10_LEVEL_HIGH                      (0x1U<<9)
#define IO_BANK0_PROC1_INTE1_GPIO10_EDGE_LOW                        (0x1U<<10)
#define IO_BANK0_PROC1_INTE1_GPIO10_EDGE_HIGH                       (0x1U<<11)
#define IO_BANK0_PROC1_INTE1_GPIO11_LEVEL_LOW                       (0x1U<<12)
#define IO_BANK0_PROC1_INTE1_GPIO11_LEVEL_HIGH                      (0x1U<<13)
#define IO_BANK0_PROC1_INTE1_GPIO11_EDGE_LOW                        (0x1U<<14)
#define IO_BANK0_PROC1_INTE1_GPIO11_EDGE_HIGH                       (0x1U<<15)
#define IO_BANK0_PROC1_INTE1_GPIO12_LEVEL_LOW                       (0x1U<<16)
#define IO_BANK0_PROC1_INTE1_GPIO12_LEVEL_HIGH                      (0x1U<<17)
#define IO_BANK0_PROC1_INTE1_GPIO12_EDGE_LOW                        (0x1U<<18)
#define IO_BANK0_PROC1_INTE1_GPIO12_EDGE_HIGH                       (0x1U<<19)
#define IO_BANK0_PROC1_INTE1_GPIO13_LEVEL_LOW                       (0x1U<<20)
#define IO_BANK0_PROC1_INTE1_GPIO13_LEVEL_HIGH                      (0x1U<<21)
#define IO_BANK0_PROC1_INTE1_GPIO13_EDGE_LOW                        (0x1U<<22)
#define IO_BANK0_PROC1_INTE1_GPIO13_EDGE_HIGH                       (0x1U<<23)
#define IO_BANK0_PROC1_INTE1_GPIO14_LEVEL_LOW                       (0x1U<<24)
#define IO_BANK0_PROC1_INTE1_GPIO14_LEVEL_HIGH                      (0x1U<<25)
#define IO_BANK0_PROC1_INTE1_GPIO14_EDGE_LOW                        (0x1U<<26)
#define IO_BANK0_PROC1_INTE1_GPIO14_EDGE_HIGH                       (0x1U<<27)
#define IO_BANK0_PROC1_INTE1_GPIO15_LEVEL_LOW                       (0x1U<<28)
#define IO_BANK0_PROC1_INTE1_GPIO15_LEVEL_HIGH                      (0x1U<<29)
#define IO_BANK0_PROC1_INTE1_GPIO15_EDGE_LOW                        (0x1U<<30)
#define IO_BANK0_PROC1_INTE1_GPIO15_EDGE_HIGH                       (0x1U<<31)

// PROC1_INTE2 Configuration

#define IO_BANK0_PROC1_INTE2_GPIO16_LEVEL_LOW                       (0x1U<<0)
#define IO_BANK0_PROC1_INTE2_GPIO16_LEVEL_HIGH                      (0x1U<<1)
#define IO_BANK0_PROC1_INTE2_GPIO16_EDGE_LOW                        (0x1U<<2)
#define IO_BANK0_PROC1_INTE2_GPIO16_EDGE_HIGH                       (0x1U<<3)
#define IO_BANK0_PROC1_INTE2_GPIO17_LEVEL_LOW                       (0x1U<<4)
#define IO_BANK0_PROC1_INTE2_GPIO17_LEVEL_HIGH                      (0x1U<<5)
#define IO_BANK0_PROC1_INTE2_GPIO17_EDGE_LOW                        (0x1U<<6)
#define IO_BANK0_PROC1_INTE2_GPIO17_EDGE_HIGH                       (0x1U<<7)
#define IO_BANK0_PROC1_INTE2_GPIO18_LEVEL_LOW                       (0x1U<<8)
#define IO_BANK0_PROC1_INTE2_GPIO18_LEVEL_HIGH                      (0x1U<<9)
#define IO_BANK0_PROC1_INTE2_GPIO18_EDGE_LOW                        (0x1U<<10)
#define IO_BANK0_PROC1_INTE2_GPIO18_EDGE_HIGH                       (0x1U<<11)
#define IO_BANK0_PROC1_INTE2_GPIO19_LEVEL_LOW                       (0x1U<<12)
#define IO_BANK0_PROC1_INTE2_GPIO19_LEVEL_HIGH                      (0x1U<<13)
#define IO_BANK0_PROC1_INTE2_GPIO19_EDGE_LOW                        (0x1U<<14)
#define IO_BANK0_PROC1_INTE2_GPIO19_EDGE_HIGH                       (0x1U<<15)
#define IO_BANK0_PROC1_INTE2_GPIO20_LEVEL_LOW                       (0x1U<<16)
#define IO_BANK0_PROC1_INTE2_GPIO20_LEVEL_HIGH                      (0x1U<<17)
#define IO_BANK0_PROC1_INTE2_GPIO20_EDGE_LOW                        (0x1U<<18)
#define IO_BANK0_PROC1_INTE2_GPIO20_EDGE_HIGH                       (0x1U<<19)
#define IO_BANK0_PROC1_INTE2_GPIO21_LEVEL_LOW                       (0x1U<<20)
#define IO_BANK0_PROC1_INTE2_GPIO21_LEVEL_HIGH                      (0x1U<<21)
#define IO_BANK0_PROC1_INTE2_GPIO21_EDGE_LOW                        (0x1U<<22)
#define IO_BANK0_PROC1_INTE2_GPIO21_EDGE_HIGH                       (0x1U<<23)
#define IO_BANK0_PROC1_INTE2_GPIO22_LEVEL_LOW                       (0x1U<<24)
#define IO_BANK0_PROC1_INTE2_GPIO22_LEVEL_HIGH                      (0x1U<<25)
#define IO_BANK0_PROC1_INTE2_GPIO22_EDGE_LOW                        (0x1U<<26)
#define IO_BANK0_PROC1_INTE2_GPIO22_EDGE_HIGH                       (0x1U<<27)
#define IO_BANK0_PROC1_INTE2_GPIO23_LEVEL_LOW                       (0x1U<<28)
#define IO_BANK0_PROC1_INTE2_GPIO23_LEVEL_HIGH                      (0x1U<<29)
#define IO_BANK0_PROC1_INTE2_GPIO23_EDGE_LOW                        (0x1U<<30)
#define IO_BANK0_PROC1_INTE2_GPIO23_EDGE_HIGH                       (0x1U<<31)

